Repository: Darahat/SensorLab
Catalog: lib/src/l10n/app_*.arb
Languages: km

source: Sign in to continue
km: ចូលប្រើដើម្បីបន្ត

source: Welcome
km: សូមស្វាគមន៍

source: Home
km: ទំព័រដើម

source: Cancel
km: បោះបង់

source: Done
km: រួចរាល់

source: Save
km: រក្សាទុក

source: Delete
km: លុប

source: Search
km: ស្វែងរក

source: Settings
km: ការកំណត់

source: Retry
km: ព្យាយាម​ម្តងទៀត

source: Error
km: កំហុស

source: Loading
km: កំពុងផ្ទុក...

source: Failed to load settings
km: ដំណើរការ​បរាជ័យក្នុងការផ្ទុកការកំណត់

source: Appearance
km: រូបរាង

source: Dark Mode
km: របៀបងងឹត

source: Switch between light and dark themes
km: ប្តូរវាងទេសងភ្លឺ និងងងឹត

source: System
km: ប្រព័ន្ធ

source: Light
km: ភ្លឺ

source: Dark
km: ងងឹត

# notificationsAndFeedback
source: Notifications & Feedback
km: ការជូនដំណឹង និងមតិយោបល់

source: Notifications
km: ការជូនដំណឹង

source: Receive app notifications
km: ទទួលការជូនដំណឹងកម្មវិធី

source: Vibration
km: កំរឹតកំដៅ

source: Haptic feedback for interactions
km: មតិកម្មអារម្មណ៍សម្រាប់អន្តរជំនួញ

source: Sound Effects
km: ផលប៉ះពាល់សំឡេង

source: Audio feedback for app actions
km: មតិកម្មសំដៅសំរាប់សកម្មភាពកម្មវិធី

source: Sensor Settings
km: ការកំណត់សែនស័រ

source: Auto Scan
km: ស្កេនស្វ័យប្រវត្តិ

source: Automatically scan when opening scanner
km: ស្កេនដោយស្វ័យប្រវត្តិនៅពេលបើកស្កេន

source: Sensor Update Frequency
km: ម្តងម្ដាល់ព័ត៌មានសែនស័រ

# sensorUpdateFrequencySubtitle
source: {frequency}ms intervals
km: {frequency} ms ពេលវេលា

# privacyAndData
source: Privacy & Data
km: ភាពឯកជន និងទិន្នន័យ

source: Data Collection
km: ប្រមូលទិន្នន័យ

source: Allow anonymous usage analytics
km: អនុញ្ញាត​វិភាគ​ការ​ប្រើប្រាស់ឥតសហអត្តសញ្ញាណ

source: Privacy Mode
km: របៀបភាពឯកជន

source: Enhanced privacy protection
km: ការការពារភាពឯកជនបន្ថែម

source: App Support
km: គាំទ្រ​កម្មវិធី

source: Show Ads
km: បង្ហាញ​ផ្សព្វផ្សាយ

source: Support app development
km: គាំទ្រការអភិវឌ្ឍកម្មវិធី

source: Reset Settings
km: កំណត់ឡើងវិញ

# resetAllSettingsToDefaultValues
source: Reset all settings to their default values. This action cannot be undone.
km: កំណត់ឡើងវិញការកំណត់ទាំងអស់ទៅតម្លៃលំនាំដើម។ សកម្មភាពនេះមិនអាចដកប្រែបាន។

source: Reset to Defaults
km: កំណត់ឡើងវិញទៅលំនាំដើម

# chooseSensorUpdateFrequency
source: Choose how often sensors should update:
km: ជ្រើសរើសម៉ោងបច្ចុប្បន្នភាពសែនស័រ៖

# fastUpdate
source: 50ms (Fast)
km: 50 ms (លឿន)

# normalUpdate
source: 100ms (Normal)
km: 100 ms (ធម្មតា)

# slowUpdate
source: 200ms (Slow)
km: 200 ms (យឺត)

# verySlowUpdate
source: 500ms (Very Slow)
km: 500 ms (យឺតខ្លាំង)

source: Apply
km: អនុវត្ត

source: Confirm Reset
km: បញ្ជាក់កំណត់ឡើងវិញ

# areYouSureResetSettings
source: Are you sure you want to reset all settings to their default values?
km: តើអ្នកប្រាកដថាចង់កំណត់ឡើងវិញការកំណត់ទាំងអស់ទៅលំនាំដើម?

source: This action cannot be undone.
km: សកម្មភាពនេះមិនអាចដកប្រែបាន។

source: Reset
km: កំណត់ឡើងវិញ

source: Accelerometer
km: ស្បែកកំលាំង

source: Compass
km: គារម

source: Flashlight
km: ភ្លើងខាងលើ

source: Gyroscope
km: ជីរ៉ូស្កុប

source: Health
km: សុខភាព

source: Humidity
km: សំណើម

source: Light Meter
km: ម៉ែត្រភ្លឺ

source: Magnetometer
km: ម៉ាណិតប៉ូម៉ែត្រ

source: Noise Meter
km: ម៉ែត្រសូរ

source: Proximity
km: ជិតស្ថិត

source: Heart Rate
km: គួរសត្រូវបេះដូង

source: Calorie Burn
km: ការរលាយកាឡូរី

source: Scanner
km: ស្កេន

source: QR Code
km: កូដ QR

source: Barcode
km: កូដរបារ

source: QR Code Scanner
km: ស្កេនកូដ QR

source: Barcode Scanner
km: ស្កេនកូដរបារ

source: Scan Result
km: លទ្ធផលស្កេន

source: Plain Text
km: អត្ថបទបែបសាមញ្ញ

source: Website URL
km: URL វេបសាយ

source: Email Address
km: អាសយដ្ឋានអ៊ីមែល

source: Phone Number
km: លេខទូរស័ព្ទ

source: SMS Message
km: សារ SMS

source: WiFi Network
km: បណ្ដាញ WiFi

source: Contact Info
km: ព័ត៌មានទំនាក់ទំនង

source: Location
km: ទីតាំង

source: Product
km: ផលិតផល

source: Calendar Event
km: ព្រឹត្តិការណ៍ប្រតិទិន

source: Quick Response Code
km: កូដចម្លើយរហ័ស

# europeanArticleNumber13
source: European Article Number (13 digits)
km: លេខអត្ថបទអឺរ៉ុប (13 ខ្ទង់)

# europeanArticleNumber8
source: European Article Number (8 digits)
km: លេខអត្ថបទអឺរ៉ុប (8 ខ្ទង់)

# universalProductCode12
source: Universal Product Code (12 digits)
km: កូដផលិតផលសកល (12 ខ្ទង់)

# universalProductCode8
source: Universal Product Code (8 digits)
km: កូដផលិតផលសកល (8 ខ្ទង់)

# code128
source: Code 128 (Variable length)
km: កូដ 128 (ប្រវែងអចិន្រ្តៃ)

# code39
source: Code 39 (Alphanumeric)
km: កូដ 39 (អក្សរណ៍លេខ)

# code93
source: Code 93 (Alphanumeric)
km: កូដ 93 (អក្សរណ៍លេខ)

# codabar
source: Codabar (Numeric with special chars)
km: Codabar (លេខជាមួយ​តួអក្សរ​ពិសេស)

# aztecCode
source: Aztec Code (2D)
km: កូដ Aztec (2D)

# torchNotAvailableOnDevice
source: Torch not available on this device
km: ពិភព័លអំពុលមិនមាននៅលើឧបករណ៍នេះ

source: Failed to initialize flashlight
km: បរាជ័យក្នុងការចាប់ផ្តើមភ្លើងខាងលើ

source: Failed to toggle flashlight
km: បរាជ័យក្នុងការបើក/បិទភ្លើងខាងលើ

source: Camera is in use
km: កាមេរ៉ាកំពុងប្រើប្រាស់

source: Torch not available
km: ភ្លើងខាងលើមិនអាចប្រើបាន

source: Failed to enable torch
km: បរាជ័យក្នុងការអនុញ្ញាតភ្លើងខាងលើ

source: Failed to disable torch
km: បរាជ័យក្នុងការហាមភ្លើងខាងលើ

# intensityControlNotSupported
source: Intensity control not supported by torch_light package
km: ការគ្រប់គ្រងកំឡាំងមិនគាំទ្រដោយកញ្ចប់ torch_light

source: Failed to set mode
km: បរាជ័យក្នុងការកំណត់ម៉ូដ

source: Failed to perform quick flash
km: បរាជ័យក្នុងការធ្វើ flash លឿន

source: No cameras found
km: មិនមានកាមេរ៉ាត្រូវបានស្វែងរក

source: Ready - Cover camera with finger
km: រួចរាល់ – បិទកាមេរ៉ាដោយដៃ

source: Camera error
km: កំហុសកាមេរ៉ា

source: Place finger firmly on camera
km: ដាក់ដៃយ៉ាងរឹងជាប់លើកាមេរ៉ា

source: Press finger firmly on camera
km: ចុចដៃយ៉ាងរឹងជាប់លើកាមេរ៉ា

source: Finger moved! Place firmly on camera
km: ដៃបានផ្លាស់ទី។ ដាក់យ៉ាងសត់នៅលើកាមេរ៉ា

# heartRateBpm
source: Heart rate: {bpm} BPM
km: សម្រាប់បេះដូង៖ {bpm} BPM

source: Hold still...
km: សូមស្ថិតស្ងប់…

source: Adjust finger pressure
km: កែតម្រូវសំពាធដៃ

source: Flash error
km: កំហុស flash

source: Edit Profile
km: កែប្រែប្រវត្តិរូប

source: Weight (kg)
km: ទម្ងន់ (គ.ក្រ.)

source: Height (cm)
km: កម្ពស់ (ស.ម.)

source: Male
km: ប្រុស

source: Female
km: ស្រី

source: Other
km: ផ្សេងទៀត

source: Save Profile
km: រក្សាទុកប្រវត្តិរូប

source: Enter Your Details
km: បញ្ចូលព័ត៌មានរបស់អ្នក

source: Initialization failed
km: ការចាប់ផ្តើមបរាជ័យ
