Repository: Darahat/SensorLab
Catalog: lib/l10n/app_*.arb
Languages: es, ja, km

source: Known Altitude
es: Altitud conocida
ja: 既知の高度
km: កម្ពស់ដែលស្គាល់

source: Calibration complete!
es: Calibración completada
ja: 校正完了
km: ការក្រិតស្តង់ដារបានបញ្ចប់

# statsReset
source: Statistics reset!
es: Estadísticas restablecidas
ja: 統計をリセット
km: កំណត់ស្ថិតិឡើងវិញ

source: Vibration Meter
es: Medidor de vibración
ja: 振動計
km: ឧបករណ៍វាស់ការរំញ័រ

# vibrationWaiting
source: Waiting for accelerometer data...
es: Esperando datos de vibración...
ja: 振動データを待っています...
km: កំពុងរង់ចាំទិន្នន័យការរំញ័រ...

source: Vibration Magnitude
es: Magnitud de vibración
ja: 振動の大きさ
km: ទំហំនៃការរំញ័រ

source: Vibration Level
es: Nivel de vibración
ja: 振動レベル
km: កម្រិតការរំញ័រ

source: Real-time Waveform
es: Forma de onda en tiempo real
ja: リアルタイム波形
km: រូបរលកតាមពេលវេលាជាក់ស្តែង

source: Pattern
es: Patrón
ja: パターン
km: លំនាំ

source: Frequency
es: Frecuencia
ja: 周波数
km: ប្រេកង់

source: Axis Breakdown
es: Desglose por eje
ja: 軸別内訳
km: ការបំបែកតាមអ័ក្ស

source: Advanced Metrics
es: Métricas avanzadas
ja: 高度なメトリクス
km: ម៉ែត្រកម្រិតខ្ពស់

source: Peak-to-Peak
es: Pico a pico
ja: ピークツーピーク
km: កំពូលទៅកំពូល

source: Crest Factor
es: Factor de cresta
ja: クレストファクター
km: កត្តាកំពូល

source: Acoustic Analyzer
es: Analizador acústico
ja: 音響アナライザー
km: ឧបករណ៍វិភាគសូរស័ព្ទ

# acousticAnalyzerTitle
source: Acoustic Environment Analyzer
es: Analizador Acústico
ja: 音響アナライザー
km: ឧបករណ៍វិភាគសូរស័ព្ទ

source: Acoustic Environment
es: Entorno acústico
ja: 音響環境
km: បរិយាកាសសូរស័ព្ទ

# presetSelectTitle
source: Choose Recording Preset
es: Seleccione un Preajuste
ja: プリセットを選択
km: ជ្រើសរើសការកំណត់ជាមុន

# presetSelectSubtitle
source: Select a preset to analyze your acoustic environment over time
es: Elija el tipo de análisis acústico
ja: 音響分析のタイプを選択
km: ជ្រើសរើសប្រភេទវិភាគសូរស័ព្ទ

# presetCustom
source: Custom
es: Personalizado
ja: カスタム
km: ផ្ទាល់ខ្លួន

# presetSleepAnalysis
source: Sleep Analysis (8h)
es: Análisis de sueño
ja: 睡眠分析
km: វិភាគការគេង

# presetWorkEnvironment
source: Work Environment (1h)
es: Entorno de trabajo
ja: 作業環境
km: បរិយាកាសការងារ

# presetFocusSession
source: Focus Session (30m)
es: Sesión de concentración
ja: 集中セッション
km: សម័យផ្តោតអារម្មណ៍

# presetCustomRecording
source: Custom Recording
es: Grabación personalizada
ja: カスタム録音
km: ការថតផ្ទាល់ខ្លួន

# monitoringTitle
source: Monitoring
es: Monitoreo
ja: モニタリング
km: ការតាមដាន

# monitoringActive
source: Recording Active
es: Monitoreo activo
ja: モニタリング中
km: ការតាមដានសកម្ម

# monitoringStopped
source: Recording Stopped
es: Monitoreo detenido
ja: モニタリング停止
km: ការតាមដានបានបញ្ឈប់

# monitoringProgress
source: Progress
es: Progreso del monitoreo
ja: モニタリング進捗
km: វឌ្ឍនភាពការតាមដាន

# monitoringCurrentLevel
source: Current Level
es: Nivel actual
ja: 現在のレベル
km: កម្រិតបច្ចុប្បន្ន

# monitoringLiveChart
source: Live Monitoring
es: Gráfico en vivo
ja: ライブチャート
km: គំនូសតាងផ្ទាល់

# recordingStop
source: Stop Recording
es: Detener grabación
ja: 録音停止
km: បញ្ឈប់ការថត

source: Recording completed
es: Grabación completada
ja: 録音完了
km: ការថតបានបញ្ចប់

# reportGeneratedSuccess
source: Report generated successfully!
es: Informe generado exitosamente
ja: レポートが正常に生成されました
km: របាយការណ៍ត្រូវបានបង្កើតដោយជោគជ័យ

# stopRecordingTooltip
source: Stop Recording
es: Detener grabación
ja: 録音を停止
km: បញ្ឈប់ការថត

# stopRecordingConfirmTitle
source: Stop Recording?
es: ¿Detener grabación?
ja: 録音を停止しますか？
km: បញ្ឈប់ការថត?

# stopRecordingConfirmMessage
source: Are you sure you want to stop the recording? The report will be generated with the current data.
es: ¿Está seguro de que desea detener la grabación actual?
ja: 現在の録音を停止してもよろしいですか？
km: តើអ្នកពិតជាចង់បញ្ឈប់ការថតបច្ចុប្បន្នមែនទេ?

# continueRecording
source: Continue
es: Continuar grabación
ja: 録音を続ける
km: បន្តការថត

# reportsTitle
source: Acoustic Reports
es: Informes
ja: レポート
km: របាយការណ៍

# reportsEmpty
source: No Reports Yet
es: Sin informes
ja: レポートなし
km: គ្មានរបាយការណ៍

# reportsEmptyDescription
source: Start an acoustic analysis session to generate your first report
es: No se encontraron informes. Inicie un análisis para crear uno.
ja: レポートが見つかりません。分析を開始して作成してください。
km: រកមិនឃើញរបាយការណ៍ទេ។ ចាប់ផ្តើមការវិភាគដើម្បីបង្កើតមួយ។

# reportsSelectedCount
source: {count} Selected
es: {count} seleccionado(s)
ja: {count}個選択
km: {count} បានជ្រើសរើស

# reportExportCSV
source: Export as CSV
es: Exportar CSV
ja: CSVをエクスポート
km: នាំចេញជា CSV

# reportExportAll
source: Export All
es: Exportar todo
ja: すべてエクスポート
km: នាំចេញទាំងអស់

# reportDelete
source: Delete
es: Eliminar
ja: 削除
km: លុប

# reportDeleteSelected
source: Delete Selected
es: Eliminar seleccionados
ja: 選択したものを削除
km: លុបអ្វីដែលបានជ្រើសរើស

# reportDeleteConfirmTitle
source: Delete Reports?
es: ¿Eliminar informe(s)?
ja: レポートを削除しますか？
km: លុបរបាយការណ៍?

# reportDeleteConfirmMessage
source: Are you sure you want to delete {count} report(s)? This action cannot be undone.
es: ¿Está seguro de que desea eliminar los informes seleccionados?
ja: 選択したレポートを削除してもよろしいですか？
km: តើអ្នកពិតជាចង់លុបរបាយការណ៍ដែលបានជ្រើសរើសមែនទេ?

# reportDeleteSuccess
source: Reports deleted
es: Informe(s) eliminado(s) exitosamente
ja: レポートが正常に削除されました
km: របាយការណ៍ត្រូវបានលុបដោយជោគជ័យ

# reportFilterByPreset
source: Filter by Preset
es: Filtrar por preajuste
ja: プリセットでフィルター
km: ច្រោះតាមការកំណត់ជាមុន

# reportFilterAll
source: All Presets
es: Todos
ja: すべて
km: ទាំងអស់

# reportStartAnalysis
source: Start Analysis
es: Iniciar análisis
ja: 分析を開始
km: ចាប់ផ្តើមការវិភាគ

# csvCopiedToClipboard
source: CSV data copied to clipboard!
es: CSV copiado al portapapeles
ja: CSVをクリップボードにコピー
km: CSV ត្រូវបានចម្លងទៅក្តារតម្បៀតខ្ទាស់

# reportDetailTitle
source: Acoustic Report
es: Detalles del informe
ja: レポート詳細
km: ព័ត៌មានលម្អិតរបាយការណ៍

# reportQualityTitle
source: Environment Quality
es: Calidad
ja: 品質
km: គុណភាព

# reportQualityScore
source: Quality Score
es: Puntuación de calidad
ja: 品質スコア
km: ពិន្ទុគុណភាព

# reportAverage
source: Average
es: Promedio
ja: 平均
km: មធ្យម

# reportPeak
source: Peak
es: Pico
ja: ピーク
km: កំពូល

# reportHourlyBreakdown
source: Hourly Breakdown
es: Desglose por hora
ja: 時間別内訳
km: ការបំបែកតាមម៉ោង

# reportNoiseEvents
source: Noise Events
es: Eventos de ruido
ja: 騒音イベント
km: ព្រឹត្តិការណ៍សំឡេង

# reportNoEventsTitle
source: No Interruptions Detected
es: Sin eventos
ja: イベントなし
km: គ្មានព្រឹត្តិការណ៍

# reportNoEventsMessage
source: Your environment was consistently quiet
es: No se detectaron eventos de ruido durante esta sesión
ja: このセッション中に騒音イベントは検出されませんでした
km: មិនរកឃើញព្រឹត្តិការណ៍សំឡេងក្នុងអំឡុងសម័យនេះទេ

# reportShare
source: Share Report
es: Compartir
ja: 共有
km: ចែករំលែក

# reportRecommendations
source: Recommendations
es: Recomendaciones
ja: 推奨事項
km: អនុសាសន៍

# reportDuration
source: Duration
es: Duración
ja: 期間
km: រយៈពេល

# reportEvents
source: events
es: Eventos
ja: イベント
km: ព្រឹត្តិការណ៍

# durationHours
source: {hours}h
es: horas
ja: 時間
km: ម៉ោង

# durationMinutes
source: {minutes}m
es: minutos
ja: 分
km: នាទី

# durationSeconds
source: {seconds}s
es: segundos
ja: 秒
km: វិនាទី

source: Noise Meter Guide
es: Guía del Medidor de Ruido
ja: 騒音計ガイド
km: មគ្គុទ្ទេសក៍ឧបករណ៍វាស់សំឡេង

source: Environment Analyzer
es: Analizador de Ambiente
ja: 環境アナライザー
km: ឧបករណ៍វិភាគបរិស្ថាន

# environmentAnalyzerSubtitle
source: Preset-based acoustic analysis
es: Análisis acústico basado en preajustes
ja: プリセットベースの音響分析
km: ការវិភាគសំឡេងតាមការកំណត់ជាមុន

# acousticReportsSubtitle
source: View saved analyses and history
es: Ver análisis guardados e historial
ja: 保存された分析と履歴を表示
km: មើលការវិភាគដែលបានរក្សាទុក និងប្រវត្តិ

source: Export Reports
es: Exportar Informes
ja: レポートのエクスポート
km: នាំចេញរបាយការណ៍

# exportChooseMethod
source: Choose how you want to export the reports:
es: Elija cómo desea exportar los informes:
ja: レポートのエクスポート方法を選択してください：
km: ជ្រើសរើសរបៀបដែលអ្នកចង់នាំចេញរបាយការណ៍៖

# exportCopyToClipboard
source: Copy to Clipboard
es: Copiar al Portapapeles
ja: クリップボードにコピー
km: ចម្លងទៅក្ដារតម្បៀតខ្ទាស់

# exportSaveAsFile
source: Save as File
es: Guardar como Archivo
ja: ファイルとして保存
km: រក្សាទុកជាឯកសារ

# exportSuccess
source: Export Successful
es: Exportación Exitosa
ja: エクスポート成功
km: នាំចេញជោគជ័យ

# exportSuccessMessage
source: {count} report(s) exported successfully!
es: ¡{count} informe(s) exportado(s) exitosamente!
ja: {count}件のレポートが正常にエクスポートされました！
km: នាំចេញរបាយការណ៍ {count} ជោគជ័យ!

source: Saved to:
es: Guardado en:
ja: 保存先：
km: រក្សាទុកនៅ៖

source: Delete Preset?
es: ¿Eliminar Preajuste?
ja: プリセットを削除しますか？
km: លុបការកំណត់ជាមុន?

# deletePresetMessage
source: Delete "{title}"? This cannot be undone.
es: ¿Eliminar "{title}"? Esto no se puede deshacer.
ja: "{title}"を削除しますか？この操作は元に戻せません。
km: លុប "{title}"? សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ។

source: Acoustic Report
es: Informe Acústico
ja: 音響レポート
km: របាយការណ៍សំឡេង

source: Create Custom Preset
es: Crear Preajuste Personalizado
ja: カスタムプリセットを作成
km: បង្កើតការកំណត់ផ្ទាល់ខ្លួន

# durationMustBeGreaterThanZero
source: Duration must be greater than 0
es: La duración debe ser mayor que 0
ja: 期間は0より大きい必要があります
km: រយៈពេលត្រូវតែធំជាង 0

source: All Presets
es: Todos los Preajustes
ja: すべてのプリセット
km: ការកំណត់ជាមុនទាំងអស់

source: Consistency
es: Consistencia
ja: 一貫性
km: ភាពស៊ីសង្វាក់គ្នា

# peakManagement
source: Peak Mgmt
es: Gestión de Picos
ja: ピーク管理
km: ការគ្រប់គ្រងកំពូល

source: Level
es: Nivel
ja: レベル
km: កម្រិត

source: Avg
es: Prom
ja: 平均
km: មធ្យម

source: Real-time Noise Levels
es: Niveles de Ruido en Tiempo Real
ja: リアルタイム騒音レベル
km: កម្រិតសំឡេងពេលវេលាជាក់ស្តែង

source: Decibel Statistics
es: Estadísticas de Decibeles
ja: デシベル統計
km: ស្ថិតិដេស៊ីបែល

source: Quiet Environment
es: Ambiente Tranquilo
ja: 静かな環境
km: បរិស្ថានស្ងប់ស្ងាត់

source: Moderate Noise
es: Ruido Moderado
ja: 中程度の騒音
km: សំឡេងមធ្យម

source: Loud Environment
es: Ambiente Ruidoso
ja: うるさい環境
km: បរិស្ថានគ្រោតគ្រាំង

source: Very Loud - Caution
es: Muy Ruidoso - Precaución
ja: 非常にうるさい - 注意
km: ខ្លាំងណាស់ - ប្រុងប្រយ័ត្ន

source: Dangerous Levels
es: Niveles Peligrosos
ja: 危険なレベル
km: កម្រិតគ្រោះថ្នាក់

source: Key Statistics
es: Estadísticas Clave
ja: 主要統計

source: Noise Events
es: Eventos de Ruido
ja: 騒音イベント

source: No Interruptions Detected
es: No se Detectaron Interrupciones
ja: 中断は検出されませんでした

# environmentConsistentlyQuiet
source: Your environment was consistently quiet
es: Su ambiente estuvo constantemente tranquilo
ja: 環境は一貫して静かでした

source: Expert Advice
es: Consejos de Experto
ja: 専門家のアドバイス

source: Quick Tips
es: Consejos Rápidos
ja: クイックヒント

# dataPoints
source: {count} points
es: {count} puntos
ja: {count}ポイント

# grantMicrophonePermission
source: Grant microphone permission to measure noise levels
es: Otorgue permiso de micrófono para medir niveles de ruido
ja: 騒音レベルを測定するためにマイクの許可を付与してください
km: ផ្តល់សិទ្ធិមីក្រូហ្វូនដើម្បីវាស់កម្រិតសំឡេង

source: Hourly Breakdown
es: Desglose por Hora
ja: 時間別内訳
km: ការបំបែកតាមម៉ោង

source: Event Timeline
es: Línea de Tiempo de Eventos
ja: イベントタイムライン
km: កាលបរិច្ឆេទព្រឹត្តិការណ៍

source: No events recorded
es: No se registraron eventos
ja: 記録されたイベントはありません
km: មិនមានព្រឹត្តិការណ៍ត្រូវបានកត់ត្រា

source: Session Details
es: Detalles de la Sesión
ja: セッションの詳細
km: ព័ត៌មានលម្អិតនៃសម័យ

source: Date
es: Fecha
ja: 日付
km: កាលបរិច្ឆេទ

source: Preset
es: Preajuste
ja: プリセット
km: ការកំណត់ជាមុន

source: Recommendation
es: Recomendación
ja: 推奨事項
km: អនុសាសន៍

source: No Interruptions
es: Sin Interrupciones
ja: 中断なし
km: គ្មានការរំខាន

# quietQuiet
source: Quiet (0-30 dB)
es: Silencioso (0-30 dB)
ja: 静か (0-30 dB)
km: ស្ងប់ស្ងាត់ (0-30 dB)

# quietModerate
source: Moderate (30-60 dB)
es: Moderado (30-60 dB)
ja: 中程度 (30-60 dB)
km: មធ្យម (30-60 dB)

# quietLoud
source: Loud (60-85 dB)
es: Ruidoso (60-85 dB)
ja: うるさい (60-85 dB)
km: គ្រោតគ្រាំង (60-85 dB)

# quietVeryLoud
source: Very Loud (85-100 dB)
es: Muy Ruidoso (85-100 dB)
ja: 非常にうるさい (85-100 dB)
km: ខ្លាំងណាស់ (85-100 dB)

# quietDangerous
source: Dangerous (100+ dB)
es: Peligroso (100+ dB)
ja: 危険 (100+ dB)
km: គ្រោះថ្នាក់ (100+ dB)

source: An error occurred.
es: Ocurrió un error.
ja: エラーが発生しました。
km: មានកំហុសបានកើតឡើង។

# failedToLoadPresets
source: Failed to load presets: {error}
es: Error al cargar preajustes: {error}
ja: プリセットの読み込みに失敗しました: {error}
km: បរាជ័យក្នុងការផ្ទុកការកំណត់ជាមុន៖ {error}

# createdPreset
source: Created "{title}"!
es: ¡Creado "{title}"!
ja: "{title}"を作成しました！
km: បានបង្កើត "{title}"!

# failedToSavePreset
source: Failed to save preset: {error}
es: Error al guardar preajuste: {error}
ja: プリセットの保存に失敗しました: {error}
km: បរាជ័យក្នុងការរក្សាទុកការកំណត់ជាមុន៖ {error}

# deleteReportsQuestion
source: Delete Reports?
es: ¿Eliminar Informes?
ja: レポートを削除しますか？
km: លុបរបាយការណ៍?

# deleteReportsConfirmMessage
source: Are you sure you want to delete the selected report(s)? This action cannot be undone.
es: ¿Está seguro de que desea eliminar los informes seleccionados? Esta acción no se puede deshacer.
ja: 選択したレポートを削除してもよろしいですか？この操作は元に戻せません。
km: តើអ្នកប្រាកដថាចង់លុបរបាយការណ៍ដែលបានជ្រើសរើស? សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ។

source: Reports deleted
es: Informes eliminados
ja: レポートが削除されました
km: របាយការណ៍ត្រូវបានលុប

source: Preset Details
es: Detalles del Preajuste
ja: プリセット詳細

# mustBeAtLeast3Chars
source: Must be at least 3 characters
es: Debe tener al menos 3 caracteres
ja: 3文字以上で入力してください

# mustBeAtLeast10Chars
source: Must be at least 10 characters
es: Debe tener al menos 10 caracteres
ja: 10文字以上で入力してください

source: Choose Icon
es: Elegir ícono
ja: アイコンを選択

source: Choose Color
es: Elegir color
ja: 色を選択

source: Custom Labs
es: Laboratorios Personalizados
ja: カスタムラボ

source: All Labs
es: Todos los Laboratorios
ja: すべてのラボ

source: My Labs
es: Mis Laboratorios
ja: マイラボ

source: No labs yet
es: Aún no hay laboratorios
ja: まだラボがありません

# createFirstLabMessage
source: Create your first custom lab to get started
es: Crea tu primer laboratorio personalizado para comenzar
ja: 最初のカスタムラボを作成して始めましょう

source: No custom labs yet
es: Aún no hay laboratorios personalizados
ja: まだカスタムラボがありません

# tapPlusToCreateLab
source: Tap the + button to create your first custom lab
es: Toca el botón + para crear tu primer laboratorio personalizado
ja: +ボタンをタップして最初のカスタムラボを作成

source: New Lab
es: Nuevo Laboratorio
ja: 新しいラボ

source: Preset Labs
es: Laboratorios Preestablecidos
ja: プリセットラボ

source: My Custom Labs
es: Mis Laboratorios Personalizados
ja: マイカスタムラボ

source: Error loading labs
es: Error al cargar laboratorios
ja: ラボの読み込みエラー

source: Create Lab
es: Crear Laboratorio
ja: ラボを作成

source: Edit Lab
es: Editar Laboratorio
ja: ラボを編集

source: Delete Lab
es: Eliminar Laboratorio
ja: ラボを削除

source: Lab Name
es: Nombre del Laboratorio
ja: ラボ名

# labNameHint
source: e.g., Motion Analysis
es: ej., Análisis de Movimiento
ja: 例：動作分析

# descriptionHint
source: Describe what this lab measures
es: Describe lo que mide este laboratorio
ja: このラボが測定する内容を説明してください

source: Recording Interval (ms)
es: Intervalo de Grabación (ms)
ja: 記録間隔（ms）

# intervalMustBeBetween
source: Interval must be between 100-10000 ms
es: El intervalo debe estar entre 100-10000 ms
ja: 間隔は100〜10000 msの範囲で指定してください

# pleaseEnterInterval
source: Please enter an interval
es: Por favor ingrese un intervalo
ja: 間隔を入力してください

# pleaseEnterLabName
source: Please enter a lab name
es: Por favor ingrese un nombre de laboratorio
ja: ラボ名を入力してください

source: Lab Color
es: Color del Laboratorio
ja: ラボの色

source: Select Sensors
es: Seleccionar Sensores
ja: センサーを選択

source: Sensors
es: Sensores
ja: センサー

source: Interval
es: Intervalo
ja: 間隔

source: Created
es: Creado
ja: 作成日

source: Sessions
es: Sesiones
ja: セッション

source: Notes
es: Notas
ja: メモ

source: Export
es: Exportar
ja: エクスポート

# chooseAtLeastOneSensor
source: Choose at least one sensor to record
es: Elija al menos un sensor para grabar
ja: 記録する少なくとも1つのセンサーを選択してください

source: Lab created successfully
es: Laboratorio creado exitosamente
ja: ラボが正常に作成されました

source: Lab updated successfully
es: Laboratorio actualizado exitosamente
ja: ラボが正常に更新されました

source: Lab deleted successfully
es: Laboratorio eliminado exitosamente
ja: ラボが正常に削除されました

# deleteLabConfirm
source: Are you sure you want to delete "{labName}"?
es: ¿Estás seguro de que quieres eliminar "{labName}"?
ja: 「{labName}」を削除してもよろしいですか？

source: Cannot modify preset labs
es: No se pueden modificar los laboratorios preestablecidos
ja: プリセットラボは変更できません

source: Cannot delete preset labs
es: No se pueden eliminar los laboratorios preestablecidos
ja: プリセットラボは削除できません

source: Please select at least one sensor
es: Por favor selecciona al menos un sensor
ja: 少なくとも1つのセンサーを選択してください

# sensorsCount
source: {count} sensors
es: {count} sensores
ja: {count}個のセンサー

# intervalMs
source: {interval}ms interval
es: Intervalo de {interval}ms
ja: {interval}ms間隔

# presetBadge
source: PRESET
es: PREESTABLECIDO
ja: プリセット

source: Lab Details
es: Detalles del Laboratorio
ja: ラボの詳細

source: Session History
es: Historial de Sesiones
ja: セッション履歴

source: Start Recording
es: Iniciar Grabación
ja: 記録を開始

source: Stop Recording
es: Detener Grabación
ja: 記録を停止

source: Pause Recording
es: Pausar Grabación
ja: 記録を一時停止

# recordingStatus
source: RECORDING
es: GRABANDO
ja: 記録中

# pausedStatus
source: PAUSED
es: PAUSADO
ja: 一時停止

# completedStatus
source: COMPLETED
es: COMPLETADO
ja: 完了

# failedStatus
source: FAILED
es: FALLIDO
ja: 失敗

# idleStatus
source: IDLE
es: INACTIVO
ja: 待機中

source: Elapsed Time
es: Tiempo Transcurrido
ja: 経過時間

source: Collecting sensor data...
es: Recopilando datos del sensor...
ja: センサーデータを収集中...

# stopRecordingQuestion
source: Stop Recording?
es: ¿Detener Grabación?
ja: 記録を停止しますか？

# stopRecordingConfirm
source: Do you want to stop and save this recording session?
es: ¿Quieres detener y guardar esta sesión de grabación?
ja: この記録セッションを停止して保存しますか？

# continueRecordingAction
source: Continue Recording
es: Continuar Grabando
ja: 記録を続ける

# stopAndSave
source: Stop & Save
es: Detener y Guardar
ja: 停止して保存

source: Recording saved successfully
es: Grabación guardada exitosamente
ja: 記録が正常に保存されました

# failedToStartRecording
source: Failed to start recording session
es: Error al iniciar sesión de grabación
ja: 記録セッションの開始に失敗しました

source: No recording sessions yet
es: Aún no hay sesiones de grabación
ja: まだ記録セッションがありません

# startRecordingToCreateSession
source: Start recording to create your first session
es: Inicia la grabación para crear tu primera sesión
ja: 記録を開始して最初のセッションを作成

source: Error loading sessions
es: Error al cargar sesiones
ja: セッションの読み込みエラー

# sessionDetailsTitle
source: Session Details
es: Detalles de la Sesión
ja: セッションの詳細

# exportAndShare
source: Export & Share
es: Exportar y Compartir
ja: エクスポートと共有

source: Delete Session
es: Eliminar Sesión
ja: セッションを削除

# deleteSessionConfirm
source: Are you sure you want to delete this recording session? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar esta sesión de grabación? Esta acción no se puede deshacer.
ja: この記録セッションを削除してもよろしいですか？この操作は元に戻せません。

source: Session deleted successfully
es: Sesión eliminada exitosamente
ja: セッションが正常に削除されました

source: Recording Time
es: Tiempo de Grabación
ja: 記録時間

source: Start Time
es: Hora de Inicio
ja: 開始時刻

source: End Time
es: Hora de Finalización
ja: 終了時刻

source: Recording Data
es: Datos de Grabación
ja: 記録データ

# dataPointsCount
source: Data Points
es: Puntos de Datos
ja: データポイント

source: Sensors Used
es: Sensores Utilizados
ja: 使用されたセンサー

# sessionExportedToCSV
source: Session has been exported to CSV
es: La sesión ha sido exportada a CSV
ja: セッションがCSVにエクスポートされました

source: Session not yet exported
es: La sesión aún no se ha exportado
ja: セッションはまだエクスポートされていません

source: Error checking export status
es: Error al verificar el estado de exportación
ja: エクスポートステータスの確認エラー

source: Data Preview
es: Vista Previa de Datos
ja: データプレビュー

source: No data points recorded
es: No se grabaron puntos de datos
ja: データポイントが記録されていません

# showingDataPoints
source: Showing {showing} of {total} data points
es: Mostrando {showing} de {total} puntos de datos
ja: {total}個中{showing}個のデータポイントを表示

# pointNumber
source: Point
es: Punto
ja: ポイント

# errorLoadingDataPoints
source: Error loading data points: {error}
es: Error al cargar puntos de datos: {error}
ja: データポイントの読み込みエラー: {error}

source: Export to CSV
es: Exportar a CSV
ja: CSVにエクスポート

# exportingStatus
source: Exporting...
es: Exportando...
ja: エクスポート中...

# exportedTo
source: Exported to: {path}
es: Exportado a: {path}
ja: エクスポート先: {path}

source: (Sharing not yet implemented)
es: (Compartir aún no implementado)
ja: （共有は未実装）

source: Failed to export session
es: Error al exportar sesión
ja: セッションのエクスポートに失敗しました

# exportedLabel
source: Exported
es: Exportado
ja: エクスポート済み

# sensorAccelerometer
source: Accelerometer
es: Acelerómetro
ja: 加速度計

# sensorGyroscope
source: Gyroscope
es: Giroscopio
ja: ジャイロスコープ

# sensorMagnetometer
source: Magnetometer
es: Magnetómetro
ja: 磁力計

# sensorBarometer
source: Barometer
es: Barómetro
ja: 気圧計

# sensorLightMeter
source: Light
es: Luz
ja: 光

# sensorNoiseMeter
source: Noise
es: Ruido
ja: 騒音

# sensorProximity
source: Proximity
es: Proximidad
ja: 近接

# sensorTemperature
source: Temp
ja: 温度

# sensorHumidity
source: Humidity
es: Humedad
ja: 湿度

# sensorPedometer
source: Pedometer
es: Podómetro
ja: 歩数計

# sensorCompass
source: Compass
es: Brújula
ja: コンパス

# sensorAltimeter
source: Altimeter
es: Altímetro
ja: 高度計

# sensorSpeedMeter
source: Speed
es: Velocidad
ja: 速度

# sensorHeartBeat
source: Heart Rate
es: Frecuencia Cardíaca
ja: 心拍数

source: Environment Monitor
es: Monitor Ambiental
ja: 環境モニター

source: Motion Analysis
es: Análisis de Movimiento
ja: 動作分析

source: Indoor Quality
es: Calidad Interior
ja: 室内品質

source: Outdoor Explorer
es: Explorador Exterior
ja: 屋外探検

source: Vehicle Dynamics
es: Dinámica Vehicular
ja: 車両ダイナミクス

# healthTrackerLab
source: Health Tracker
es: Monitor de Salud
ja: 健康トラッカー

source: OK
es: Aceptar
km: យល់ព្រម

source: BMI
es: IMC

source: km/h
km: គីឡូម៉ែត្រក្នុងម៉ោង

source: Code 128/39
km: កូដ 128/39

# actionOk
source: OK
km: យល់ព្រម

# csvHeaderID
source: ID
km: លេខសម្គាល់
