Repository: Darahat/SensorLab
Catalog: lib/l10n/app_*.arb
Languages: es, ja, km

source: Sign in to continue
es: Inicia sesión para continuar
ja: 続行するにはサインインしてください
km: ចូលប្រើដើម្បីបន្ត

source: Welcome
es: Bienvenido
ja: ようこそ
km: សូមស្វាគមន៍

source: Home
es: Inicio
ja: ホーム
km: ទំព័រដើម

source: Cancel
es: Cancelar
ja: キャンセル
km: បោះបង់

source: Done
es: Listo
ja: 完了
km: រួចរាល់

source: Save
es: Guardar
ja: 保存
km: រក្សាទុក

source: Delete
es: Eliminar
ja: 削除
km: លុប

source: Search
es: Buscar
ja: 検索
km: ស្វែងរក

source: Settings
es: Configuración
ja: 設定
km: ការកំណត់

source: Retry
es: Reintentar
ja: 再試行
km: សាកម្តងទៀត

source: Error
ja: エラー
km: កំហុស

source: Loading
es: Cargando
ja: 読み込み中
km: កំពុងផ្ទុក

source: Failed to load settings
es: Error al cargar la configuración
ja: 設定の読み込みに失敗しました
km: បរាជ័យក្នុងការផ្ទុកការកំណត់

source: Appearance
es: Apariencia
ja: 外観
km: រូបរាង

source: Dark Mode
es: Modo oscuro
ja: ダークモード
km: របៀបងងឹត

source: Switch between light and dark themes
es: Alternar entre temas claro y oscuro
ja: ライトモードとダークモードを切り替える
km: ប្ដូរវាងអេឡិចត្រូនិច‌លើពន្លឺ និង ភ្នែកងងឹត

source: System
es: Sistema
ja: システム
km: ប្រព័ន្ធ

source: Light
es: Claro
ja: ライト
km: ភ្លឺ

source: Dark
es: Oscuro
ja: ダーク
km: ងងឹត

source: Language
es: Idioma
ja: 言語
km: ភាសា

# languageSubtitle
source: Choose your preferred language
es: Elige tu idioma preferido
ja: 好みの言語を選択してください
km: ជ្រើសរើសភាសាដែលអ្នកចូលចិត្ត

# notificationsAndFeedback
source: Notifications & Feedback
es: Notificaciones y comentarios
ja: 通知とフィードバック
km: ការជូនដំណឹង និងមតិយោបល់

source: Notifications
es: Notificaciones
ja: 通知
km: ការជូនដំណឹង

source: Receive app notifications
es: Recibir notificaciones de la aplicación
ja: アプリの通知を受け取る
km: ទទួលការជូនដំណឹងពីកម្មវិធី

source: Vibration
es: Vibración
ja: バイブレーション
km: ការបក់

source: Haptic feedback for interactions
es: Retroalimentación háptica para las interacciones
ja: 操作に対する触覚フィードバック
km: តបតទៅប៉ះភ្នែក​សម្រាប់ចលនា

source: Sound Effects
es: Efectos de sonido
ja: サウンド効果
km: ប 영향을់សម្លេង

source: Audio feedback for app actions
es: Retroalimentación de audio para acciones de la app
ja: 操作に対する音声フィードバック
km: តបតទៅសំឡេងសម្រាប់សកម្មភាពកម្មវិធី

source: Sensor Settings
es: Configuración de sensores
ja: センサー設定
km: ការកំណត់ឧបករណ៍សន្សើម

source: Auto Scan
es: Escaneo automático
ja: 自動スキャン
km: ស្កេនស្វ័យប្រវត្តិ

source: Automatically scan when opening scanner
es: Escanear automáticamente al abrir el escáner
ja: スキャナーを開いたときに自動的にスキャンする
km: ស្កេនដោយស្វ័យប្រវត្តិពេលបើកកម្មវិធីស្កេន

source: Sensor Update Frequency
es: Frecuencia de actualización del sensor
ja: センサー更新頻度
km: សម្រង់ភាពតម្រូវការអាប់ដេតឧបករណ៍សន្សើម

# sensorUpdateFrequencySubtitle
source: {frequency}ms intervals
es: {frequency} ms intervalos
ja: {frequency}ms 間隔
km: {frequency}ms ចន្លោះពេល

# privacyAndData
source: Privacy & Data
es: Privacidad y datos
ja: プライバシーとデータ
km: ភាពឯកជន និងទិន្នន័យ

source: Data Collection
es: Recolección de datos
ja: データ収集
km: ការប្រមូលទិន្នន័យ

source: Allow anonymous usage analytics
es: Permitir análisis anónimo de uso
ja: 匿名の利用分析を許可する
km: អនុញ្ញាតវិភាគប្រើប្រាស់ដោយកម្រិតអនាមិក

source: Privacy Mode
es: Modo privacidad
ja: プライバシーモード
km: របៀបភាពឯកជន

source: Enhanced privacy protection
es: Protección de privacidad mejorada
ja: 強化プライバシー保護
km: ការការពារភាពឯកជនមួួយ

source: App Support
es: Soporte de la aplicación
ja: アプリサポート
km: ការគាំទ្រកម្មវិធី

source: Show Ads
es: Mostrar anuncios
ja: 広告を表示
km: បង្ហាញ ផ្សព្វផ្សាយ

source: Support app development
es: Apoyar el desarrollo de la app
ja: アプリ開発を支援する
km: គាំទ្រ ការអភិវឌ្ឍកម្មវិធី

source: Reset Settings
es: Restablecer ajustes
ja: 設定をリセット
km: កំណត់ឡើងវិញ

# resetAllSettingsToDefaultValues
source: Reset all settings to their default values. This action cannot be undone.
es: Restablecer todos los ajustes a sus valores predeterminados. Esta acción no puede deshacerse.
ja: すべての設定をデフォルト値に戻します。この操作は元に戻せません。
km: កំណត់ឡើងវិញគ្រប់កំណត់ទៅតម្លៃលំនាំដើម។ សកម្មភាពនេះមិនអាចកែបញ្ចូលវិញបាន។

source: Reset to Defaults
es: Restablecer a los valores predeterminados
ja: デフォルトに戻す
km: កំណត់ឡើងវិញទៅលំនាំដើម

# chooseSensorUpdateFrequency
source: Choose how often sensors should update:
es: Elige con qué frecuencia deben actualizarse los sensores:
ja: センサーの更新頻度を選択してください：
km: ជ្រើសរើសចំនួនដងដែលឧបករណ៍សន្សើមត្រូវធ្វើបច្ចុប្បន្នភាព៖

# fastUpdate
source: 50ms (Fast)
es: 50 ms (Rápido)
ja: 50ms（高速）
km: 50ms (លឿន)

# normalUpdate
source: 100ms (Normal)
ja: 100ms（標準）
km: 100ms (ធម្មតា)

# slowUpdate
source: 200ms (Slow)
es: 200 ms (Lento)
ja: 200ms（低速）
km: 200ms (យឺត)

# verySlowUpdate
source: 500ms (Very Slow)
es: 500 ms (Muy lento)
ja: 500ms（非常に低速）
km: 500ms (យឺតខ្លាំង)

source: Apply
es: Aplicar
ja: 適用
km: អនុវត្ត

source: Confirm Reset
es: Confirmar restablecimiento
ja: リセットを確認
km: បញ្ជាក់ ការកំណត់ឡើងវិញ

# areYouSureResetSettings
source: Are you sure you want to reset all settings to their default values?
es: ¿Estás seguro de que deseas restablecer todos los ajustes a sus valores predeterminados?
ja: すべての設定を既定値に戻してもよろしいですか？
km: តើអ្នកប្រាកដថាចង់កំណត់ឡើងវិញគ្រប់ការកំណត់ទៅតម្លៃលំនាំដើម?

source: This action cannot be undone.
es: Esta acción no puede deshacerse.
ja: この操作は元に戻せません。
km: សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ។

source: Reset
es: Restablecer
ja: リセット
km: កំណត់ឡើងវិញ

source: Accelerometer
es: Acelerómetro
ja: 加速度計
km: ឧបករណ៍វាស់ល្បឿនលោត

source: Compass
es: Brújula
ja: コンパス
km: កំរិតខាងភាគខាងត្បូង

source: Flashlight
es: Linterna
ja: 懐中電灯
km: ភ្លើងថ្ម

source: Gyroscope
es: Giroscopio
ja: ジャイロスコープ
km: ហ្ស៊ីអ៊ីស្កោប

source: Health
es: Salud
ja: 健康
km: សុខភាព

source: Humidity
es: Humedad
ja: 湿度
km: សំណើម

source: Light Meter
es: Medidor de luz
ja: 照度計
km: ម៉ែត្រពន្លឺ

source: Magnetometer
es: Magnetómetro
ja: 磁力計
km: ម៉ែត្រមាញ៉េទិច

source: Noise Meter
es: Medidor de ruido
ja: 騒音計
km: ម៉ែត្រសំឡេង

source: Proximity
es: Proximidad
ja: 近接
km: ការញែកសំណិត

source: Speed Meter
es: Velocímetro
ja: 速度計
km: ឧបករណ៍វាស់ល្បឿន

source: Heart Rate
es: Frecuencia cardíaca
ja: 心拍数
km: អត្រា​បេះដូង

source: Calorie Burn
es: Quema de calorías
ja: 消費カロリー
km: ការដាច់ថាមពល

source: Scanner
es: Escáner
ja: スキャナー
km: ស្កេន

source: QR Code
es: Código QR
ja: QRコード
km: កូដ QR

source: Barcode
es: Código de barras
ja: バーコード
km: កូដប៉ារ៉ូដ

source: QR Code Scanner
es: Escáner de QR
ja: QRコードスキャナー
km: ស្គេន​កូដ QR

source: Barcode Scanner
es: Escáner de código de barras
ja: バーコードスキャナー
km: ស្គេន​កូដប៉ារ៉ូដ

source: Scan Result
es: Resultado del escaneo
ja: スキャン結果
km: លទ្ធផលស្កេន

source: Plain Text
es: Texto plano
ja: プレーンテキスト
km: អត្ថបទសាមញ្ញ

source: Website URL
es: URL del sitio web
ja: ウェブサイト URL
km: URL គេហទំព័រ

source: Email Address
es: Correo electrónico
ja: メールアドレス
km: អាសយដ្ឋានអ៊ីមែល

source: Phone Number
es: Número de teléfono
ja: 電話番号
km: លេខទូរស័ព្ទ

source: SMS Message
es: Mensaje SMS
ja: SMS メッセージ
km: សារ SMS

source: WiFi Network
es: Red Wi-Fi
ja: Wi-Fi ネットワーク
km: បណ្តាញ WiFi

source: Contact Info
es: Información de contacto
ja: 連絡先情報
km: ព័ត៌មានទំនាក់ទំនង

source: Location
es: Ubicación
ja: 位置情報
km: ទីតាំង

source: Product
es: Producto
ja: 製品
km: ផលិតផល

source: Calendar Event
es: Evento del calendario
ja: カレンダーイベント
km: ព្រឹត្តិការណ៍ប្រតិទិន

source: Quick Response Code
es: Código de respuesta rápida
ja: QR コード
km: កូដចម្លើយរហ័ស

# europeanArticleNumber13
source: European Article Number (13 digits)
es: Número de artículo europeo (13 dígitos)
ja: 欧州記事番号 (13 桁)
km: លេខអត្ថបទអឺរ៉ុប (13 ខ្ទង់)

# europeanArticleNumber8
source: European Article Number (8 digits)
es: Número de artículo europeo (8 dígitos)
ja: 欧州記事番号 (8 桁)
km: លេខអត្ថបទអឺរ៉ុប (8 ខ្ទង់)

# universalProductCode12
source: Universal Product Code (12 digits)
es: Código universal de producto (12 dígitos)
ja: ユニバーサル商品コード (12 桁)
km: កូដផលិតផលសៈពល (12 ខ្ទង់)

# universalProductCode8
source: Universal Product Code (8 digits)
es: Código universal de producto (8 dígitos)
ja: ユニバーサル商品コード (8 桁)
km: កូដផលិតផលសៈពល (8 ខ្ទង់)

# code128
source: Code 128 (Variable length)
es: Código 128 (longitud variable)
ja: コード 128（可変長）
km: កូដ 128 (ប្រវែងខុសគ្នា)

# code39
source: Code 39 (Alphanumeric)
es: Código 39 (Alfanumérico)
ja: コード 39（英数字）
km: កូដ 39 (អាល់ហ្វា-លេខ)

# code93
source: Code 93 (Alphanumeric)
es: Código 93 (Alfanumérico)
ja: コード 93（英数字）
km: កូដ 93 (អាល់ហ្វា-លេខ)

# codabar
source: Codabar (Numeric with special chars)
es: Codabar (Numérico con caracteres especiales)
ja: Codabar（特殊文字付き数字）
km: Codabar (លេខជាមួយតួអក្សរ)

source: Interleaved 2 of 5
es: Intercalado 2 de 5
ja: インターリーブ 2 of 5

# aztecCode
source: Aztec Code (2D)
es: Código Azteca (2D)
ja: Aztec コード (2D)
km: កូដ Aztec (2D)

# torchNotAvailableOnDevice
source: Torch not available on this device
es: Linterna no disponible en este dispositivo
ja: このデバイスでは懐中電灯が利用できません
km: ភ្លើងថ្មមិនមាននៅលើឧបករណ៍នេះទេ

source: Failed to initialize flashlight
es: Error al inicializar la linterna
ja: 懐中電灯の初期化に失敗しました
km: បរាជ័យក្នុងការចាប់ផ្ដើមភ្លើងថ្ម

source: Failed to toggle flashlight
es: Error al activar/desactivar la linterna
ja: 懐中電灯の切り替えに失敗しました
km: បរាជ័យក្នុងការប្ដូរភ្លើងថ្ម

source: Camera is in use
es: La cámara está en uso
ja: カメラが使用中です
km: កាមេរីកំពុងត្រូវបានប្រើ

source: Torch not available
es: Linterna no disponible
ja: 懐中電灯が利用できません
km: ភ្លើងថ្មមិនអាចប្រើបាន

source: Failed to enable torch
es: Error al habilitar la linterna
ja: 懐中電灯を有効にできませんでした
km: បរាជ័យក្នុងការបើកភ្លើងថ្ម

source: Failed to disable torch
es: Error al deshabilitar la linterna
ja: 懐中電灯を無効にできませんでした
km: បរាជ័យក្នុងការបិទភ្លើងថ្ម

# intensityControlNotSupported
source: Intensity control not supported by torch_light package
es: Control de intensidad no compatible con el paquete torch_light
ja: torch_light パッケージでは強度制御をサポートしていません
km: ការគ្រប់គ្រងកម្រិតមិនគាំទ្រដោយកញ្ចប់ torch_light

source: Failed to set mode
es: Error al establecer el modo
ja: モード設定に失敗しました
km: បរាជ័យក្នុងការកំណត់របៀប

source: Failed to perform quick flash
es: Error al realizar flash rápido
ja: クイックフラッシュの実行に失敗しました
km: បរាជ័យក្នុងការអនុវត្ត flash ដោយរហ័ស

source: No cameras found
es: No se encontraron cámaras
ja: カメラが見つかりません
km: មិនមានកាមេរ៉ាមួយកន្លែងណាទេ

source: Ready - Cover camera with finger
es: Listo — cubre la cámara con el dedo
ja: 準備完了 — カメラを指で覆ってください
km: រួចរាល់ — លាក់កាមេរីដោយម្រាមដៃ

source: Camera error
es: Error de cámara
ja: カメラエラー
km: កំហុសកាមេរ៉ា

source: Place finger firmly on camera
es: Coloca el dedo firmemente sobre la cámara
ja: カメラの上に指をしっかり置いてください
km: ដាក់ម្រាមដៃយ៉ាងមាំលើកាមេរ៉ា

source: Press finger firmly on camera
es: Presiona el dedo firmemente sobre la cámara
ja: カメラの上に指をしっかり押し当ててください
km: ចុចម្រាមដៃយ៉ាងមាំលើកាមេរ៉ា

source: Finger moved! Place firmly on camera
es: El dedo se movió — colócalo firmemente en la cámara
ja: 指が動きました — しっかり置き直してください
km: ម្រាមដៃផ្លាស់ -> ដាក់ឱ្យម៉ាំលើកាមេរ៉ា

# heartRateBpm
source: Heart rate: {bpm} BPM
es: Frecuencia cardíaca: {bpm} BPM
ja: 心拍数: {bpm} BPM
km: អត្រាបេះដូង: {bpm} BPM

source: Hold still...
es: Mantente quieto…
ja: 動かないでください…
km: សូមឈប់ស្ងាត់...

source: Adjust finger pressure
es: Ajusta la presión del dedo
ja: 指の圧力を調整してください
km: កែសម្ពាធម្រាមដៃ

source: Flash error
es: Error de flash
ja: フラッシュエラー
km: កំហុសแฟลช

source: Edit Profile
es: Editar perfil
ja: プロフィール編集
km: កែរព័ត៌មានផ្ទាល់ខ្លួន

source: Weight (kg)
es: Peso (kg)
ja: 体重 (kg)
km: ទម្ងន់ (គក្រ)

source: Height (cm)
es: Altura (cm)
ja: 身長 (cm)
km: កម្ពស់ (សម្តិក)

source: Male
es: Hombre
ja: 男性
km: ប្រុស

source: Female
es: Mujer
ja: 女性
km: ស្រី

source: Other
es: Otro
ja: その他
km: ផ្សេងទៀត

source: Save Profile
es: Guardar perfil
ja: プロフィールを保存
km: រក្សាកំណត់អ្នកប្រើ

source: Enter Your Details
es: Introduce tus datos
ja: 詳細を入力してください
km: បញ្ចូលព័ត៌មានរបស់អ្នក

source: Initialization failed
es: Inicialización fallida
ja: 初期化に失敗しました
km: ការចាប់ផ្ដើមបរាជ័យ

source: All your sensors in one place
es: Todos tus sensores en un lugar
ja: すべてのセンサーを一か所に
km: ឧបករណ៍សន្សើមរបស់អ្នកទាំងអស់នៅកន្លែងតែមួយ

source: No sensors available
es: No hay sensores disponibles
ja: 使用可能なセンサーがありません
km: មិនមានឧបករណ៍សន្សើមណាបង្ហាញ

source: ACTIVE
es: ACTIVO
ja: アクティブ
km: សកម្ម

source: MOVE YOUR DEVICE
es: MUEVE TU DISPOSITIVO
ja: デバイスを動かしてください
km: ផ្លាស់ប្តូរឧបករណ៍អ្នក

# accelerationUnit
source: Acceleration (m/s²)
es: Aceleración (m/s²)
ja: 加速度 (m/s²)
km: ល្បឿន (m/s²)

source: Axis
es: Eje
ja: 軸
km: អ័ក្ស

source: Current
es: Actual
ja: 現在
km: បច្ចុប្បន្ន

source: Max
es: Máximo
ja: 最大
km: អតិបរិមា

source: Calibrate
es: Calibrar
ja: キャリブレーション
km: សម្រឹង

source: Calibrating...
es: Calibrando…
ja: キャリブレーション中…
km: កំពុងសម្រឹង...

source: Magnetic Heading
es: Dirección magnética
ja: 磁気方位
km: ទិសដៅឧស្ម័ន

source: High Accuracy
es: Alta precisión
ja: 高精度
km: ភាពច្បាស់ខ្ពស់

source: Compass Error
es: Error en la brújula
ja: コンパスエラー
km: កំហុសកំរិតខាង

source: Reset Session
es: Reiniciar sesión
ja: セッションをリセット
km: កំណត់សម័យឡើងវិញ

source: Flashlight Not Available
es: Linterna no disponible
ja: 懐中電灯が利用できません
km: ភ្លើងថ្មមិនអាចប្រើបាន

source: Initializing Flashlight...
es: Inicializando linterna…
ja: 懐中電灯を初期化中…
km: កំពុងចាប់ផ្ដើមភ្លើងថ្ម...

# deviceDoesNotHaveFlashlight
source: Device does not have a flashlight or it's not accessible
es: El dispositivo no tiene linterna o no es accesible
ja: デバイスに懐中電灯がないかアクセスできません
km: ឧបករណ៍មិនមានភ្លើងថ្ម ឬ មិនអាចចូលប្រើបាន

source: Try Again
es: Intenta de nuevo
ja: もう一度
km: ព្យាយាមម្តងទៀត

source: Quick Flash
es: Flash rápido
ja: クイックフラッシュ
km: แฟลชរហ័ស

source: Turn Off
es: Apagar
ja: オフ
km: បិទ

source: Turn On
es: Encender
ja: オン
km: បើក

source: Intensity Control
es: Control de intensidad
ja: 強度制御
km: គ្រប់គ្រងកម្រិត

source: Current: {intensity}
es: Actual: {intensity}
ja: 現在: {intensity}
km: បច្ចុប្បន្ន: {intensity}

source: Flashlight Modes
es: Modos de linterna
ja: 懐中電灯モード
km: របៀបភ្លើងថ្ម

source: Normal
ja: 通常
km: ធម្មតា

source: Strobe
es: Estroboscópico
ja: ストロボ
km: ស្រ្តូប

source: Session Statistics
es: Estadísticas de la sesión
ja: セッション統計
km: ស្ថិតិសម័យ

source: Session Time
es: Tiempo de sesión
ja: セッション時間
km: ពេលសម័យ

source: Toggles
es: Controles
ja: 切替
km: ប្ដូរ

source: On Time
es: Tiempo activo
ja: オン時間
km: ពេលមាន

source: Battery Usage
es: Uso de batería
ja: バッテリー使用量
km: ការប្រើថាមពលប៊ែតเตอรี่

source: Battery Usage Warning
es: Advertencia de uso de batería
ja: バッテリー使用警告
km: ការព្រមព្រៀងការប្រើថាមពលប៊ែតเตอรี่

# flashlightOnFor
source: Flashlight has been on for {time}. Consider turning it off to save battery.
es: La linterna ha estado encendida por {time}. Considera apagarla para ahorrar batería.
ja: 懐中電灯は {time} 間オン状態です。省エネのためオフをご検討ください。
km: ភ្លើងថ្មបានដំណើរការ {time} ហើយ។ សូមពិចារណាបិទដើម្បីរក្សាសង្គ្រោះថាមពល។

source: Usage Tips
es: Consejos de uso
ja: 使用のヒント
km: គន្លឹះនៅពេលប្រើ

source: Normal Mode
es: Modo normal
ja: 通常モード
km: របៀបធម្មតា

# normalModeDescription
source: Standard flashlight operation
es: Operación estándar de linterna
ja: 標準的な懐中電灯操作
km: ប្រតិបត្តិការភ្លើងថ្មផ្ទាល់ខ្លួន

source: Strobe Mode
es: Modo estroboscópico
ja: ストロボモード
km: របៀប​ស្រ្តូប

# strobeModeDescription
source: Flashing light for attention
es: Luz parpadeante para llamar la atención
ja: 点滅ライトで注目を集める
km: ភ្លើងបន្លឿនសម្រាប់ទាក់ទាញចិត្ត

source: SOS Mode
es: Modo SOS
ja: SOSモード
km: របៀប SOS

# sosModeDescription
source: Emergency signal (... --- ...)
es: Señal de emergencia (... --- ...)
ja: 緊急信号（… --- …）
km: សញ្ញាផ emergência (... --- ...)

source: Battery
es: Batería
ja: バッテリー
km: ថាមពលប៊ែតเตอรี่

# batteryTip
source: Monitor usage to preserve battery life
es: Monitorea el uso para preservar la batería
ja: バッテリー消費を抑えるためにモニタリングしてください
km: តាមដានការប្រើថាមពលដើម្បីរក្សាប៊ែតเตอรี่

source: Intensity
es: Intensidad
ja: 強度
km: កម្រិត

# intensityTip
source: Adjust brightness to save power
es: Ajusta el brillo para ahorrar energía
ja: 明るさを調整して電力を節約
km: កែសំឡេងដើម្បីសន្សំពលកម្ម

# pressButtonToGetLocation
source: Press the button to get location
es: Presiona el botón para obtener ubicación
ja: ボタンを押して位置を取得
km: ចុចប៊ូតុងដើម្បីទទួលទីតាំង

source: Address will appear here
es: La dirección aparecerá aquí
ja: 住所がここに表示されます
km: ទំព័រអាសយដ្ឋាននឹងបង្ហាញទីនេះ

# locationServicesDisabled
source: Location services are disabled
es: Los servicios de ubicación están desactivados
ja: 位置情報サービスが無効です
km: សេវាកម្មទីតាំងបានបិទ

source: Location permission denied
es: Permiso de ubicación denegado
ja: 位置情報の許可が拒否されました
km: ការអនុញ្ញាតទីតាំងត្រូវបានបដិសេធ

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied
es: Permisos de ubicación permanentemente denegados
ja: 位置情報の許可が永久に拒否されました
km: ការអនុញ្ញាតទីតាំងត្រូវបានបដិសេធជាអចិន្រ្តៃយ៍

# errorGettingLocation
source: Error getting location: {error}
es: Error al obtener ubicación: {error}
ja: 位置の取得エラー: {error}
km: កំហុសក្នុងការទទួលទីតាំង: {error}

# failedToGetAddress
source: Failed to get address: {error}
es: Error al obtener dirección: {error}
ja: 住所の取得に失敗しました: {error}
km: បរាជ័យក្នុងការទទួលអាសយដ្ឋាន: {error}

# noAppToOpenMaps
source: No app available to open maps
es: No hay aplicación para abrir mapas
ja: 地図を開くアプリがありません
km: មិនមានកម្មវិធីសម្រាប់បើកផែនទី

source: Geolocator
es: Geolocalizador
ja: ジオロケーター
km: កម្មវិធីកំណត់ទីតាំង

# accuracy
source: Accuracy: {accuracy}
es: Precisión: {accuracy}
ja: 精度: {accuracy}
km: ភាពត្រឹមត្រូវ: {accuracy}

source: Please enable location services
es: Por favor, activa los servicios de ubicación
ja: 位置情報サービスを有効にしてください
km: សូមបើកសេវាកម្មទីតាំង

source: Please grant location permissions
es: Por favor, concede los permisos de ubicación
ja: 位置情報の許可を付与してください
km: សូមផ្តល់អនុញ្ញាតចូលប្រើទីតាំង

source: Locating...
es: Localizando...
ja: 位置情報取得中…
km: កំពុងស្វែងទីតាំង...

source: Get Current Location
es: Obtener ubicación actual
ja: 現在の位置を取得
km: ទទួលទីតាំងបច្ចុប្បន្ន

source: Open in Maps
es: Abrir en mapas
ja: 地図で開く
km: បើកនៅផែនទី

source: About Geolocator
es: Acerca del geolocalizador
ja: ジオロケーターについて
km: អំពី Geolocator

# geolocatorDescription
source: This tool shows your current location using your device's GPS. Features: • Precise latitude/longitude coordinates • Estimated accuracy measurement • Reverse geocoding to get address • Open location in maps For best results, ensure you have: • Location services enabled • Clear view of the sky • Internet connection for address lookup
es: Esta herramienta muestra tu ubicación actual usando el GPS del dispositivo. Características: • Coordenadas precisas de latitud/longitud • Estimación de precisión • Geocodificación inversa para obtener dirección • Abrir ubicación en mapas Para mejores resultados, asegúrate de: • Tener activados los servicios de ubicación • Tener una vista despejada del cielo • Estar conectado a Internet para buscar dirección
ja: このツールは、端末の GPS を使って現在の位置を表示します。 機能: • 緯度/経度の正確な座標 • 精度の推定 • 逆ジオコーディングによる住所取得 • 地図で位置を表示 最良の結果を得るには: • 位置情報サービスを有効にする • 空が見える場所に移動する • 住所検索のためインターネット接続を有効にする
km: ឧបករណ៍នេះបង្ហាញទីតាំងបច្ចុប្បន្នរបស់អ្នកដោយប្រើ GPS ក្នុងឧបករណ៍របស់អ្នក។ មុខងារ៖ • កូអរដោនេត latitude/longitude យ៉ាងត្រឹមត្រូវ • ការវាស់ភាពត្រឹមត្រូវ • ការបំលែងវិញទៅអាសយដ្ឋាន • បើកទីតាំងនៅលើផែនទី ដើម្បីទទួលលទ្ធផលល្អ៖ • បើកសេវាកម្មទីតាំង • រកទីតាំងដែលមានទំហំមេឃស្អាត • តភ្ជាប់អ៊ីនធឺណិតសម្រាប់ស្វែងរកអាសយដ្ឋាន

source: Tracking
es: Rastreando
ja: 追跡中
km: កំពុងតាមដាន

source: Waiting for GPS...
es: Esperando GPS...
ja: GPS待機中...
km: រង់ចាំ GPS...

source: Max Speed
es: Velocidad máxima
ja: 最高速度
km: ល្បឿនអតិបរមា

source: Avg Speed
es: Velocidad promedio
ja: 平均速度
km: ល្បឿនមធ្យម

source: Motion Intensity
es: Intensidad de movimiento
ja: モーション強度
km: កម្រិតចលនា

# liveSensorGraph
source: Live Sensor Graph (X - Red, Y - Green, Z - Blue)
es: Gráfico de sensores en vivo (X – Rojo, Y – Verde, Z – Azul)
ja: ライブセンサーグラフ (X = 赤, Y = 緑, Z = 青)
km: ក្រาฟិកឧបករណ៍សន្សើមបន្ត (X – ក្រហម, Y – បៃតង, Z – ខៀវ)

# angularVelocity
source: Angular velocity (rad/s)
es: Velocidad angular (rad/s)
ja: 角速度 (rad/s)
km: ល្បឿនមុំ (rad/s)

source: Health Tracker
es: Rastreador de salud
ja: ヘルストラッカー
km: ត្រួតពិនិត្យសុខភាព

# helloUser
source: Hello, {name}!
es: Hola, {name}!
ja: こんにちは、{name}さん！
km: សួស្តី, {name}!

# readyToTrackSession
source: Ready to track your {activity} session?
es: ¿Listo para rastrear tu sesión de {activity}?
ja: {activity} のセッションを記録しますか？
km: តើអ្នករៀបចំតាមដានសម័យ {activity} រួចហើយ?

source: BMR
es: TMB
ja: 基礎代謝 (BMR)

source: Steps
es: Pasos
ja: ステップ数
km: ជំហាន

source: Distance
es: Distancia
ja: 距離
km: ចម្ងាយ

source: Duration
es: Duración
ja: 時間
km: កំឡុងពេល

source: Activity Type
es: Tipo de actividad
ja: アクティビティタイプ
km: ប្រភេទសកម្មភាព

source: Stop
es: Detener
ja: 停止
km: បញ្ឈប់

source: Resume
es: Reanudar
ja: 再開
km: បន្ត

source: Start
es: Iniciar
ja: 開始
km: ចាប់ផ្ដើម

source: Pause
es: Pausa
ja: 一時停止
km: ឈប់សម្រាក

source: Live Sensor Data
es: Datos de sensores en vivo
ja: リアルタイムセンサーデータ
km: ទិន្នន័យឧបករណ៍សន្សើមបន្ត

source: Avg Intensity
es: Intensidad promedio
ja: 平均強度
km: កម្រិតមធ្យម

source: Peak Intensity
es: Intensidad máxima
ja: ピーク強度
km: កម្រិតអតិបរិមា

source: Movements
es: Movimientos
ja: 動き
km: ចលនាការ

source: Calories Burned
es: Calorías quemadas
ja: 消費カロリー
km: កាលូរីដែលបានដាច់

# bmrPerDay
source: BMR: {bmr} cal/day
es: TMB: {bmr} cal/día
ja: 基礎代謝: {bmr} cal/日
km: BMR: {bmr} cal/ថ្ងៃ

source: Profile Settings
es: Configuración de perfil
ja: プロフィール設定
km: ការកំណត់ប្រវត្តិរូប

source: Name
es: Nombre
ja: 名前
km: ឈ្មោះ

source: Age
es: Edad
ja: 年齢
km: អាយុ

source: Weight
es: Peso
ja: 体重
km: ទម្ងន់

source: Height
es: Altura
ja: 身長
km: កម្ពស់

source: Heart Rate Monitor
es: Monitor de frecuencia cardíaca
ja: 心拍数モニタ
km: ម៉ូនីទ័រអត្រាបេះដូង

source: Toggle flash
es: Alternar flash
ja: フラッシュ切り替え
km: ប្ដូរភ្លើងថ្ម

# quietEnvironmentNeeded
source: Quiet environment needed ({seconds} s)
es: Se necesita ambiente silencioso ({seconds} s)
ja: 静かな環境が必要です ({seconds} 秒)
km: ត្រូវការបរិយាកាសស្ងាត់ ({seconds} វិនាទី)

source: Estimated Heart Rate
es: Frecuencia cardíaca estimada
ja: 推定心拍数
km: អត្រាបេះដូងប៉ាន់ស្មើ

source: Flash Off
es: Flash apagado
ja: フラッシュオフ
km: ភ្លើងថ្មបិទ

source: Flash On
es: Flash encendido
ja: フラッシュオン
km: ភ្លើងថ្មបើក

source: Stable measurement
es: Medición estable
ja: 安定測定
km: ការវាស់ឥតប្រើបរមា

source: Reset Data
es: Restablecer datos
ja: データリセット
km: កំណត់ទិន្នន័យឡើងវិញ

# noHumiditySensor
source: No Humidity Sensor Detected
es: No se detectó sensor de humedad
ja: 湿度センサーが検出されません
km: មិនរកឃើញឧបករណ៍សំណើម

# noHumiditySensorDescription
source: Most smartphones don't have humidity sensors. Showing simulated data for demonstration.
es: La mayoría de los smartphones no tienen sensores de humedad. Mostrando datos simulados para demostración.
ja: ほとんどのスマホには湿度センサーがありません。デモ用にシミュレーションデータを表示しています。
km: ទូរស័ព្ទច្រើនមិនមានឧបករណ៍សំណើម។ បង្ហាញទិន្នន័យប្រមាណសម្រាប់ការសាកល្បង។

source: Check Again
es: Comprobar de nuevo
ja: 再確認
km: ពិនិត្យម្ដងទៀត

source: Measuring
es: Midiendo
ja: 測定中
km: កំពុងវាស់

source: Stopped
es: Detenido
ja: 停止
km: ឈប់

source: Single Reading
es: Lectura única
ja: 単一読み取り
km: ការអានតែមួយ

source: Continuous
es: Continuo
ja: 連続
km: ប្រកបដោយបន្ត

source: Comfort Assessment
es: Evaluación de confort
ja: 快適性評価
km: ការវាយតម្លៃផាសុកភាព

source: Readings
es: Lecturas
ja: 読み取り
km: ការអាន

source: Average
es: Promedio
ja: 平均
km: មធ្យម

source: Real-time Humidity Levels
es: Niveles de humedad en tiempo real
ja: リアルタイム湿度レベル
km: សំណើមក្នុងពេលពិត

source: Humidity Level Guide
es: Guía de niveles de humedad
ja: 湿度レベルガイド
km: មគ្គុទេសក៍កម្រិតសំណើម

source: Very Dry
es: Muy seco
ja: 非常に乾燥
km: ស្រួលស្ងួត

source: Dry
es: Seco
ja: 乾燥
km: ស្ងួត

source: Comfortable
es: Cómodo
ja: 快適
km: ផាសុកភាព

source: Humid
es: Húmedo
ja: 湿度高め
km: សំណើម

source: Very Humid
es: Muy húmedo
ja: 非常に湿度高い
km: សំណើមខ្ពស់

source: Proximity Sensor
es: Sensor de proximidad
ja: 近接センサー
km: ឧបករណ៍សន្សើមជិត

source: Permission Required
es: Permiso requerido
ja: 許可が必要です
km: តម្រូវការអនុញ្ញាត

source: Sensor Not Available
es: Sensor no disponible
ja: センサーが利用できません
km: ឧបករណ៍សន្សើមមិនអាចប្រើបាន

source: Grant Permission
es: Conceder permiso
ja: 許可を与える
km: ផ្តល់អនុញ្ញាត

source: Permission Granted
es: Permiso concedido
ja: 許可が付与されました
