Repository: Darahat/SensorLab
Catalog: lib/l10n/app_*.arb
Languages: es, ja, km

source: Microphone permission denied
es: Permiso de micrófono denegado
ja: マイクの許可が拒否されました

# microphonePermissionPermanentlyDenied
source: Microphone permission was permanently denied. Please enable it in your device settings to use the noise meter.
es: El permiso del micrófono fue denegado permanentemente. Por favor, habilítalo en la configuración de tu dispositivo para usar el medidor de ruido.
ja: マイクの許可が永久に拒否されました。ノイズメーターを使用するには、デバイス設定で有効にしてください。

source: Open Settings
es: Abrir configuración
ja: 設定を開く

source: Microphone Access Needed
es: Acceso al micrófono necesario
ja: マイクアクセスが必要です

# microphoneAccessDescription
source: To measure and analyze sound levels accurately, we need access to your device's microphone. Your audio is never recorded or stored.
es: Para medir y analizar los niveles de sonido con precisión, necesitamos acceso al micrófono de tu dispositivo. Tu audio nunca se graba ni se almacena.
ja: 音声レベルを正確に測定および分析するには、デバイスのマイクへのアクセスが必要です。音声は記録または保存されることはありません。

# measureNoiseLevels
source: Measure noise levels in real-time
es: Medir niveles de ruido en tiempo real
ja: リアルタイムでノイズレベルを測定

# analyzeAcoustics
source: Analyze acoustic environment
es: Analizar el entorno acústico
ja: 音響環境を分析

# generateReports
source: Generate detailed reports
es: Generar informes detallados
ja: 詳細なレポートを生成

source: Allow Microphone Access
es: Permitir acceso al micrófono
ja: マイクアクセスを許可

# audioNotRecorded
source: Audio is never recorded or stored
es: El audio nunca se graba ni se almacena
ja: 音声は記録または保存されません

source: Inactive
es: Inactivo
ja: 非アクティブ
km: មិនសកម្ម

source: Monitor
es: Monitorear
ja: モニタ
km: ត្រួតពិនិត្យ

source: Total Readings
es: Lecturas totales
ja: 読み取り数合計
km: ចំនួនការអានសរុប

source: Near
es: Cerca
ja: 近い
km: នៅជិត

source: Far
es: Lejos
ja: 遠い
km: ឆ្ងាយ

source: Proximity Activity Timeline
es: Cronología de actividad de proximidad
ja: 近接アクティビティ履歴
km: ពេលវេលាសកម្មភាពជិត

source: How Proximity Sensor Works
es: Cómo funciona el sensor de proximidad
ja: 近接センサーの仕組み
km: របៀបឧបករណ៍សន្សើមជិតធ្វើការ

source: Scan Barcode
es: Escanear código de barras
ja: バーコードをスキャン
km: ស្កេនកូដប៉ារ៉ូដ

# positionBarcodeInFrame
source: Position the barcode within the frame
es: Coloca el código dentro del marco
ja: バーコードをフレーム内に配置してください
km: ដាក់កូដក្នុងស៊្នស៍

# scanningForBarcodes
source: Scanning for UPC, EAN, Code 128, Code 39, and other linear barcodes
es: Escaneando UPC, EAN, Código 128, Código 39 y otros códigos lineales
ja: UPC、EAN、コード128、コード39などをスキャン中
km: កំពុងស្កេន UPC, EAN, កូដ 128, 39 និងអន្ដរូ

source: Scan QR Code
es: Escanear código QR
ja: QR コードをスキャン
km: ស្កេន QR ឃូដ

# positionQrCodeInFrame
source: Position the QR code within the frame
es: Coloca el QR dentro del marco
ja: QR コードをフレーム内に配置してください
km: ដាក់ QR ឃូដក្នុងស៊្នស៍

# scanningForQrCodes
source: Scanning for QR codes, Data Matrix, PDF417, and Aztec codes
es: Escaneando códigos QR, Data Matrix, PDF417 y códigos Azteca
ja: QR コード、Data Matrix、PDF417、Aztec コードをスキャン中
km: កំពុងស្កេន QR, Data Matrix, PDF417, Aztec

# scannedOn
source: Scanned {timestamp}
es: Escaneado el {timestamp}
ja: スキャン日時: {timestamp}
km: បានស្កេននៅ {timestamp}

source: Content
es: Contenido
ja: 内容
km: ខ្លឹមសារ

source: Quick Actions
es: Acciones rápidas
ja: クイック操作
km: សកម្មភាពរហ័ស

source: Technical Details
es: Detalles técnicos
ja: 技術詳細
km: ព័ត៌មានបច្ចេកទេស

source: Format
es: Formato
ja: 形式
km: ទ្រង់ទ្រាយ

source: Description
es: Descripción
ja: 説明
km: ការពិពណ៌នា

source: Data Length
es: Longitud de datos
ja: データ長
km: ប្រវែងទិន្នន័យ

source: Scan Type
es: Tipo de escaneo
ja: スキャンタイプ
km: ប្រភេទស្កេន

source: Content Type
es: Tipo de contenido
ja: コンテンツタイプ
km: ប្រភេទខ្លឹមសារ

source: Copy All
es: Copiar todo
ja: すべてコピー
km: ចម្លងទាំងអស់

source: Share
es: Compartir
ja: 共有
km: ចែករំលែក

source: Scan Another
es: Escanear otro
ja: 別をスキャン
km: ស្កេនមួយទៀត

source: Copied to clipboard
es: Copiado al portapapeles
ja: クリップボードにコピー済み
km: បានចម្លងទៅក្លិបប័រដ

# contentCopied
source: Content copied to clipboard for sharing
es: Contenido copiado al portapapeles para compartir
ja: 内容をクリップボードにコピーしました
km: ខ្លឹមសារត្រូវបានចម្លងទៅក្លិបប័រដសម្រាប់ចែករំលែក

source: Cannot open URL
es: No se puede abrir la URL
ja: URL を開けません
km: មិនអាចបើក URL ណាមួយ

source: Choose Scanner Type
es: Elige tipo de escáner
ja: スキャナー種別を選択
km: ជ្រើសប្រភេទស្កេន

# selectScannerDescription
source: Select the type of code you want to scan
es: Selecciona el tipo de código que deseas escanear
ja: スキャンしたいコードの種類を選んでください
km: ជ្រើសប្រភេទកូដដែលអ្នកចង់ស្កេន

source: Common uses:
es: Usos comunes:
ja: 一般的な用途：
km: ការប្រើប្រាស់ទូទៅ៖

source: Scanning Tips
es: Consejos de escaneo
ja: スキャンのヒント
km: គន្លឹះស្កេន

# scanningTipsDescription
source: Hold your device steady and ensure the code is well-lit and clearly visible within the scanner frame.
es: Mantén tu dispositivo estable y asegúrate de que el código esté bien iluminado y claramente visible dentro del marco del escáner.
ja: デバイスを安定させ、コードがフレーム内で明るく鮮明に見えるようにしてください。
km: សូមដាក់ឧបករណ៍របស់អ្នកឱ្យស្ថិតស្ថេរ និងធ្វើឱ្យកូដមានពន្លឺល្អក្នុងស៊្នស៍។

# minStat
source: Min
es: Mín
ja: 最小
km: អប្បបរមា

# maxStat
source: Max
es: Máx
ja: 最大
km: អតិបរមា

source: Gender
es: Género
ja: 性別
km: ភេទ

source: Select Activity
es: Seleccionar actividad
ja: アクティビティを選択
km: ជ្រើសសកម្មភាព

source: Walking
es: Caminando
ja: 歩く
km: ដើរ

source: Running
es: Corriendo
ja: 走る
km: រត់

source: Cycling
es: Ciclismo
ja: サイクリング
km: ជិះកង់

source: Sitting
es: Sentado
ja: 座る
km: អង្គុយ

source: Standing
es: De pie
ja: 立つ
km: ឈរ

source: Stairs
es: Escaleras
ja: 階段
km: ជណ្តើរ

source: Workout
es: Ejercicio
ja: ワークアウト
km: ហាត់ប្រាណ

source: Environment
es: Entorno
ja: 環境
km: បរិស្ថាន

source: Navigation
es: Navegación
ja: ナビゲーション
km: ការរុករក

source: Motion
es: Movimiento
ja: モーション
km: ចលនា

source: Magnetic
es: Magnético
ja: 磁気
km: ស្រឡាយ

source: Device
es: Dispositivo
ja: デバイス
km: ឧបករណ៍

source: Utility
es: Utilidad
ja: ユーティリティ
km: សារៈប្រយោជន៍

source: Menu
es: Menú
ja: メニュー
km: ម៉ឺនុយ

source: MOVING
es: EN MOVIMIENTO
ja: 移動中
km: កំពុងចលនា

source: STATIONARY
es: DETENIDO
ja: 停止中
km: ឈរជាប់

source: Feet
es: Pies
ja: フィート
km: ជើង

source: Inches
es: Pulgadas
ja: インチ
km: អ៊ីញ

source: Product barcodes
es: Códigos de barras de productos
ja: 商品バーコード
km: បាកូដផលិតផល

source: ISBN numbers
es: Números ISBN
ja: ISBN番号
km: លេខ ISBN

source: UPC codes
es: Códigos UPC
ja: UPCコード
km: កូដ UPC

source: EAN codes
es: Códigos EAN
ja: EANコード
km: កូដ EAN

source: Website URLs
es: URLs de sitios web
ja: ウェブサイトURL
km: URL វេបសាយ

source: WiFi passwords
es: Contraseñas WiFi
ja: WiFiパスワード
km: ពាក្យសម្ងាត់ WiFi

source: Contact information
es: Información de contacto
ja: 連絡先情報
km: ព័ត៌មានទំនាក់ទំនង

source: Location coordinates
es: Coordenadas de ubicación
ja: 位置座標
km: កូអរដោនេទីតាំង

source: Calendar events
es: Eventos de calendario
ja: カレンダーイベント
km: ព្រឹត្តិការណ៍ប្រតិទិន

source: Near Detection
es: Detección Cercana
ja: 近距離検出
km: ការរកឃើញនៅជិត

# objectDetectedClose
source: Object detected close to sensor
es: Objeto detectado cerca del sensor
ja: センサーの近くで物体を検出
km: វត្ថុត្រូវបានរកឃើញនៅជិតឧបករណ៍ចាប់សញ្ញា

# usuallyWithin5cm
source: Usually when something is within 5cm of the sensor
es: Generalmente cuando algo está dentro de 5cm del sensor
ja: 通常、センサーから5cm以内に何かがある場合
km: ជាធម្មតានៅពេលមានអ្វីមួយនៅក្នុងរយៈ 5 សង់ទីម៉ែត្រពីឧបករណ៍ចាប់សញ្ញា

source: Far Detection
es: Detección Lejana
ja: 遠距離検出
km: ការរកឃើញនៅឆ្ងាយ

# noObjectDetected
source: No object detected nearby
es: No se detectó ningún objeto cerca
ja: 近くに物体が検出されません
km: មិនបានរកឃើញវត្ថុនៅជិតទេ

# clearAreaAroundSensor
source: Clear area around the proximity sensor
es: Área despejada alrededor del sensor
ja: センサー周辺のエリアをクリア
km: តំបន់ស្អាតជុំវិញឧបករណ៍ចាប់សញ្ញា

# tooDryIrritation
source: Too dry - may cause skin and respiratory irritation
es: Demasiado seco - puede causar irritación en la piel y respiración
ja: 乾燥しすぎ - 皮膚や呼吸器の刺激を引き起こす可能性があります
km: ស្ងួតពេក - អាចបណ្តាលឱ្យស្បែកនិងដង្ហើមរលាក

# somewhatDryHumidifier
source: Somewhat dry - consider using a humidifier
es: Algo seco - considera usar un humidificador
ja: やや乾燥 - 加湿器の使用を検討してください
km: ស្ងួតបន្តិច - គួរពិចារណាប្រើម៉ាស៊ីនបន្ថែមសំណើម

# idealHumidityLevel
source: Ideal humidity level for comfort and health
es: Nivel de humedad ideal para comodidad y salud
ja: 快適さと健康に理想的な湿度レベル
km: កម្រិតសំណើមល្អសម្រាប់ការងាយស្រួលនិងសុខភាព

# somewhatHumidSticky
source: Somewhat humid - may feel sticky
es: Algo húmedo - puede sentirse pegajoso
ja: やや湿度が高い - べたつく感じがするかもしれません
km: មានសំណើមបន្តិច - អាចមានអារម្មណ៍ជាប់

# tooHumidMold
source: Too humid - may promote mold growth
es: Demasiado húmedo - puede favorecer el crecimiento de moho
ja: 湿度が高すぎます - カビの繁殖を促進する可能性があります
km: សើម្ពេក - អាចបណ្តាលឱ្យមានផ្សិតលូតលាស់

source: Flashlight ON
es: Linterna ENCENDIDA
ja: フラッシュライト オン
km: ភ្លើងបំភ្លឺ បើក

source: Flashlight OFF
es: Linterna APAGADA
ja: フラッシュライト オフ
km: ភ្លើងបំភ្លឺ បិទ

source: meters
es: metros
ja: メートル
km: ម៉ែត្រ

source: Real-time Light Levels
es: Niveles de Luz en Tiempo Real
ja: リアルタイム照度レベル
km: កម្រិតពន្លឺពេលវេលាពិត

source: Light Level Guide
es: Guía de Niveles de Luz
ja: 照度レベルガイド
km: មគ្គុទេសក៍កម្រិតពន្លឺ

# darkLevel
source: Dark
es: Oscuro
ja: 暗い
km: ងងឹត

# dimLevel
source: Dim
es: Tenue
ja: 薄暗い
km: ចុងចាំងបន្តិច

# indoorLevel
source: Indoor
es: Interior
ja: 屋内
km: ក្នុងផ្ទះ

# officeLevel
source: Office
es: Oficina
ja: オフィス
km: ការិយាល័យ

# brightLevel
source: Bright
es: Brillante
ja: 明るい
km: ភ្លឺ

# daylightLevel
source: Daylight
es: Luz del día
ja: 日光
km: ពន្លឺថ្ងៃ

# darkExample
source: Night, no moonlight
es: Noche, sin luz de luna
ja: 夜、月明かりなし
km: យប់ គ្មានពន្លឺព្រះច័ន្ទ

# dimExample
source: Moonlight, candle
es: Luz de luna, vela
ja: 月明かり、ろうそく
km: ពន្លឺព្រះច័ន្ទ ទៀន

# indoorExample
source: Living room lighting
es: Iluminación de sala de estar
ja: リビングルーム照明
km: ពន្លឺបន្ទប់ទទួលភ្ញៀវ

# officeExample
source: Office workspace
es: Espacio de trabajo de oficina
ja: オフィスワークスペース
km: កន្លែងធ្វើការការិយាល័យ

# brightExample
source: Bright room, cloudy day
es: Habitación brillante, día nublado
ja: 明るい部屋、曇りの日
km: បន្ទប់ភ្លឺ ថ្ងៃមេឃ

# daylightExample
source: Direct sunlight
es: Luz solar directa
ja: 直射日光
km: ពន្លឺព្រះអាទិត្យផ្ទាល់

# grantSensorPermission
source: Grant sensor permission to access proximity sensor
es: Conceder permisos de sensor para acceder al sensor de proximidad
ja: 近接センサーにアクセスするためのセンサー権限を許可してください
km: ផ្តល់ការអនុញ្ញាតឧបករណ៍ចាប់សញ្ញាដើម្បីចូលប្រើឧបករណ៍ចាប់សញ្ញាភាពជិត

# deviceNoProximitySensor
source: Device does not have a proximity sensor
es: El dispositivo no tiene un sensor de proximidad
ja: デバイスには近接センサーがありません
km: ឧបករណ៍មិនមានឧបករណ៍ចាប់សញ្ញាភាពជិត

# proximitySensorLocation
source: The proximity sensor is typically located near the earpiece and is used to turn off the screen during phone calls.
es: El sensor de proximidad se encuentra típicamente cerca del auricular y se usa para apagar la pantalla durante las llamadas telefónicas.
ja: 近接センサーは通常イヤピース付近に位置し、通話中に画面を消すために使用されます。
km: ឧបករណ៍ចាប់សញ្ញាភាពជិតធម្មតាស្ថិតនៅក្បែរកាសឆ្នាំ និងប្រើសម្រាប់បិទអេក្រង់កំឡុងពេលហៅទូរស័ព្ទ។

# pausedCameraInUse
source: Paused - Camera in use by another feature
es: Pausado - Cámara en uso por otra función
ja: 一時停止 - カメラが他の機能で使用中
km: បានផ្អាក - ម៉ាស៊ីនថតកំពុងប្រើដោយមុខងារផ្សេង

# generalError
source: Error: {error}
ja: エラー: {error}
km: កំហុស: {error}

# currentMode
source: Current mode: {mode}
es: Modo actual: {mode}
ja: 現在のモード: {mode}
km: របៀបបច្ចុប្បន្ន: {mode}

source: Noise Level Guide
es: Guía de Niveles de Ruido
ja: 騒音レベルガイド
km: មគ្គុទ្ទេសក៍កម្រិតសម្លេង

source: Quiet
es: Silencioso
ja: 静か
km: ស្ងាត់

source: Moderate
es: Moderado
ja: 適度
km: មធ្យម

source: Loud
es: Fuerte
ja: 大きい
km: ខ្លាំង

source: Very Loud
es: Muy Fuerte
ja: 非常に大きい
km: ខ្លាំងណាស់

source: Dangerous
es: Peligroso
ja: 危険
km: ថ្នាក់ថ្នម

source: Whisper, library
es: Susurro, biblioteca
ja: 囁き声、図書館
km: សំឡេងខ្សឹប, បណ្ណាល័យ

source: Normal conversation
es: Conversación normal
ja: 普通の会話
km: ការសន្ទនាធម្មតា

source: Traffic, office
es: Tráfico, oficina
ja: 交通、オフィス
km: ចរាចរណ៍, ការិយាល័យ

source: Motorcycle, shouting
es: Motocicleta, gritos
ja: オートバイ、叫び声
km: ម៉ូតូ, ការស្រែក

source: Rock concert, chainsaw
es: Concierto de rock, motosierra
ja: ロックコンサート、チェーンソー
km: ការប្រគុំតន្រ្តី rock, ម៉ាស៊ីនកាត់ឈើ

source: QR/Barcode Scanner
es: Escáner QR/Código de Barras
ja: QR/バーコードスキャナ
km: ម៉ាស៊ីនស្កេន QR/បាកូដ

source: Scanned Data
es: Datos Escaneados
ja: スキャンデータ
km: ទិន្នន័យបានស្កេន

source: Copy
es: Copiar
ja: コピー
km: ចម្លង

source: Clear
es: Limpiar
ja: クリア
km: លុប

source: Page Not Found
es: Página No Encontrada
ja: ページが見つかりません
km: រកមិនឃើញទំព័រ

source: Go Home
es: Ir al Inicio
ja: ホームに戻る
km: ត្រឡប់ទៅទំព័រដើម

# pageNotFoundMessage
source: Page not found: {uri}
es: Página no encontrada: {uri}
ja: ページが見つかりません: {uri}
km: រកមិនឃើញទំព័រ: {uri}

source: More
es: Más
ja: 詳細
km: ច្រើនទៀត

source: Theme
es: Tema
ja: テーマ
km: ធីម

source: About
es: Acerca de
ja: について
km: អំពី

source: All Settings
es: Todas las Configuraciones
ja: すべての設定
km: ការកំណត់ទាំងអស់

source: Get notified about sensor readings
es: Recibir notificaciones sobre lecturas de sensores
ja: センサー読み取り値の通知を受け取る
km: ទទួលការជូនដំណឹងអំពីការអានឧបករណ៍ចាប់សញ្ញា

# themeChangeRequiresRestart
source: Theme switching requires app restart
es: El cambio de tema requiere reiniciar la aplicación
ja: テーマの変更にはアプリの再起動が必要です
km: ការផ្លាស់ប្តូរធីមត្រូវការចាប់ផ្តើមកម្មវិធីឡើងវិញ

source: Quick Settings
es: Configuración Rápida
ja: クイック設定
km: ការកំណត់លឿន

source: Dark mode active
es: Modo oscuro activo
ja: ダークモード有効
km: ម៉ូដងងឹតសកម្ម

source: Light mode active
es: Modo claro activo
ja: ライトモード有効
km: ម៉ូដភ្លឺសកម្ម

source: SENSOR DATA
es: DATOS DEL SENSOR
ja: センサーデータ
km: ទិន្នន័យឧបករណ៍ចាប់សញ្ញា

# stepsLabel
source: Steps
es: Pasos
ja: 歩数
km: ជំហាន

source: Accel X
es: Acel X
ja: 加速度X
km: បង្កើនល្បឿន X

source: Accel Y
es: Acel Y
ja: 加速度Y
km: បង្កើនល្បឿន Y

source: Accel Z
es: Acel Z
ja: 加速度Z
km: បង្កើនល្បឿន Z

source: Gyro X
es: Giro X
ja: ジャイロX
km: ជីរ៉ូ X

source: Gyro Y
es: Giro Y
ja: ジャイロY
km: ជីរ៉ូ Y

source: Gyro Z
es: Giro Z
ja: ジャイロZ
km: ជីរ៉ូ Z

# qrScannerSubtitle
source: Scan QR codes, Data Matrix, PDF417, and Aztec codes
es: Escanear códigos QR, Data Matrix, PDF417 y códigos Azteca
ja: QRコード、Data Matrix、PDF417、Aztecコードをスキャン
km: ស្កែន QR កូដ, Data Matrix, PDF417, និងកូដ Aztec

# barcodeScannerSubtitle
source: Scan product barcodes like UPC, EAN, Code 128, and more
es: Escanear códigos de barras de productos como UPC, EAN, Code 128 y más
ja: UPC、EAN、Code 128などの商品バーコードをスキャン
km: ស្កែនបាកូដផលិតផលដូចជា UPC, EAN, Code 128, និងច្រើនទៀត

source: Activity
es: Actividad
ja: アクティビティ
km: សកម្មភាព

source: START TRACKING
es: INICIAR SEGUIMIENTO
ja: トラッキング開始
km: ចាប់ផ្តើមតាមដាន

source: STOP TRACKING
es: DETENER SEGUIMIENTO
ja: トラッキング停止
km: បញ្ឈប់ការតាមដាន

source: Tracking Active
es: Seguimiento Activo
ja: トラッキング中
km: ការតាមដានដំណើរការ

source: Session Paused
es: Sesión Pausada
ja: セッション一時停止
km: សម័យបានផ្អាក

source: Update your personal information
es: Actualiza tu información personal
ja: 個人情報を更新する
km: ធ្វើបច្ចុប្បន្នភាពព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នក

source: Personal Information
es: Información Personal
ja: 個人情報
km: ព័ត៌មានផ្ទាល់ខ្លួន

source: Physical Measurements
es: Medidas Físicas
ja: 身体測定
km: ការវាស់ផ្នែករាងកាយ

source: Enter your full name
es: Ingresa tu nombre completo
ja: フルネームを入力してください
km: បញ្ចូលឈ្មោះពេញរបស់អ្នក

source: Please enter your name
es: Por favor ingresa tu nombre
ja: 名前を入力してください
km: សូមបញ្ចូលឈ្មោះរបស់អ្នក

source: Enter your age
es: Ingresa tu edad
ja: 年齢を入力してください
km: បញ្ចូលអាយុរបស់អ្នក

source: Please enter your age
es: Por favor ingresa tu edad
ja: 年齢を入力してください
km: សូមបញ្ចូលអាយុរបស់អ្នក

# pleaseEnterValidNumber
source: Please enter a valid number
es: Por favor ingresa un número válido
ja: 有効な数値を入力してください
km: សូមបញ្ចូលលេខត្រឹមត្រូវ

source: Select your gender
es: Selecciona tu género
ja: 性別を選択してください
km: ជ្រើសរើសភេទរបស់អ្នក

source: Enter your weight in kg
es: Ingresa tu peso en kg
ja: 体重をkgで入力してください
km: បញ្ចូលទម្ងន់របស់អ្នកជា kg

source: Please enter your weight
es: Por favor ingresa tu peso
ja: 体重を入力してください
km: សូមបញ្ចូលទម្ងន់របស់អ្នក

source: Enter your height in cm
es: Ingresa tu altura en cm
ja: 身長をcmで入力してください
km: បញ្ចូលកម្ពស់របស់អ្នកជា cm

source: Please enter your height
es: Por favor ingresa tu altura
ja: 身長を入力してください
km: សូមបញ្ចូលកម្ពស់របស់អ្នក

source: Pedometer
es: Podómetro
ja: 歩数計
km: គណនីជំហាន

source: Daily Goal
es: Meta Diaria
ja: 1日の目標
km: គោលដៅប្រចាំថ្ងៃ

# stepsToGo
source: to go
es: por alcanzar
ja: 残り
km: នៅសល់

source: Goal Reached!
es: ¡Meta Alcanzada!
ja: 目標達成！
km: បានសម្រេចគោលដៅ!

source: Calories
es: Calorías
ja: カロリー
km: កាឡូរី

source: Pace
es: Ritmo
ja: ペース
km: ល្បឿន

source: Cadence
es: Cadencia
ja: ケイデンス
km: ចង្វាក់

source: Set Daily Goal
es: Establecer Meta Diaria
ja: 1日の目標を設定
km: កំណត់គោលដៅប្រចាំថ្ងៃ

# resetSessionConfirmation
source: Are you sure you want to reset your current session? All progress will be lost.
es: ¿Estás seguro de que deseas reiniciar tu sesión actual? Todo el progreso se perderá.
ja: 現在のセッションをリセットしてもよろしいですか？すべての進捗が失われます。
km: តើអ្នកប្រាកដថាចង់កំណត់សម័យឡើងវិញទេ? ដំណើរការទាំងអស់នឹងត្រូវបាត់បង់។

source: Barometer
es: Barómetro
ja: 気圧計
km: ឧបករណ៍វាស់សម្ពាធ

source: Waiting for sensor...
es: Esperando sensor...
ja: センサー待機中...
km: កំពុងរង់ចាំឧបករណ៍...

source: Clear Weather
es: Clima Despejado
ja: 晴天
km: អាកាសស្រឡះ

source: Cloudy Weather
es: Clima Nublado
ja: 曇天
km: អាកាសមានពពក

source: Stable Weather
es: Clima Estable
ja: 安定天候
km: អាកាសថេរ

# pressureRising
source: Rising
es: Subiendo
ja: 上昇中
km: កំពុងកើនឡើង

# pressureFalling
source: Falling
es: Bajando
ja: 下降中
km: កំពុងធ្លាក់ចុះ

# pressureSteady
source: Steady
es: Estable
ja: 安定
km: ថេរ

source: Maximum
es: Máximo
ja: 最大
km: អតិបរមា

source: Minimum
es: Mínimo
ja: 最小
km: អប្បបរមា

source: Altitude
es: Altitud
ja: 高度
km: កម្ពស់

# presetSleep
source: Sleep
es: Dormir
ja: 睡眠
km: ដេក

# presetSleepTitle
source: Analyze Sleep Environment
es: Analizar Entorno de Sueño
ja: 睡眠環境を分析
km: វិភាគបរិយាកាសដេក

# presetSleepDuration
source: 8 hours
es: 8 horas
ja: 8時間
km: ៨ ម៉ោង

# presetSleepDescription
source: Monitor bedroom noise throughout the night to improve sleep quality
es: Monitorea el ruido del dormitorio durante la noche para mejorar la calidad del sueño
ja: 睡眠の質を改善するために夜間の寝室のノイズを監視
km: តាមដានសំឡេងក្នុងបន្ទប់គេងពេញមួយយប់ ដើម្បីកែលម្អគុណភាពនៃការគេង

# presetWork
source: Work
es: Trabajo
ja: 作業
km: ការងារ

# presetWorkTitle
source: Monitor Office Environment
es: Monitorear Entorno de Oficina
ja: オフィス環境を監視
km: តាមដានបរិយាកាសការិយាល័យ

# presetWorkDuration
source: 1 hour
es: 1 hora
ja: 1時間
km: ១ ម៉ោង

# presetWorkDescription
source: Track workplace noise levels and identify distractions
es: Rastrea los niveles de ruido en el lugar de trabajo e identifica distracciones
ja: 職場の騒音レベルを追跡し、気を散らすものを特定
km: តាមដានកម្រិតសំឡេងនៅកន្លែងធ្វើការ និងកំណត់អត្តសញ្ញាណរបស់វត្ថុរំខាន

# presetFocus
source: Focus
es: Concentración
ja: 集中
km: ការផ្តោតអារម្មណ៍

# presetFocusTitle
source: Focus Session Analysis
es: Análisis de Sesión de Concentración
ja: 集中セッション分析
km: វិភាគសម័យផ្តោតអារម្មណ៍

# presetFocusDuration
source: 30 minutes
es: 30 minutos
ja: 30分
km: ៣០ នាទី

# presetFocusDescription
source: Analyze your study or focus session environment
es: Analiza tu entorno de estudio o sesión de concentración
ja: 学習または集中セッションの環境を分析
km: វិភាគបរិយាកាសសិក្សា ឬសម័យផ្តោតអារម្មណ៍របស់អ្នក

# recordingStart
source: Start Recording
es: Iniciar Grabación
ja: 録音開始
km: ចាប់ផ្តើមថត

# monitoringEnvironment
source: Monitoring acoustic environment...
es: Monitoreando Entorno
ja: 環境監視中
km: កំពុងតាមដានបរិយាកាស

source: Noise Level
es: Nivel de ruido
ja: 騒音レベル
km: កម្រិតសំឡេង

# durationHoursMinutes
source: {hours}h {minutes}m
ja: {hours}時間{minutes}分
km: {hours} ម៉ោង {minutes} នាទី

# qualityExcellent
source: Excellent
es: Excelente
ja: 優秀
km: ល្អបំផុត

# qualityGood
source: Good
es: Bueno
ja: 良好
km: ល្អ

# qualityFair
source: Fair
es: Regular
ja: 普通
km: ជាមធ្យម

# qualityPoor
source: Poor
es: Pobre
ja: 悪い
km: ខ្សោយ

# unitHours
source: hours
es: horas
ja: 時間
km: ម៉ោង

# unitMinutes
source: minutes
es: minutos
ja: 分
km: នាទី

# unitSeconds
source: seconds
es: segundos
ja: 秒
km: វិនាទី

# actionContinue
source: Continue
es: Continuar
ja: 続ける
km: បន្ត

# actionStop
source: Stop
es: Detener
ja: 停止
km: បញ្ឈប់

# actionStart
source: Start
es: Iniciar
ja: 開始
km: ចាប់ផ្តើម

# actionView
source: View
es: Ver
ja: 表示
km: មើល

# actionExport
source: Export
es: Exportar
ja: エクスポート
km: នាំចេញ

# actionShare
source: Share
es: Compartir
ja: 共有
km: ចែករំលែក

source: View Historical Reports
es: Ver Informes Históricos
ja: 過去のレポートを表示
km: មើលរបាយការណ៍ប្រវត្តិសាស្ត្រ

# csvHeaderStartTime
source: Start Time
es: Hora de inicio
ja: 開始時刻
km: ពេលចាប់ផ្តើម

# csvHeaderEndTime
source: End Time
es: Hora de finalización
ja: 終了時刻
km: ពេលបញ្ចប់

# csvHeaderDuration
source: Duration (min)
es: Duración (min)
ja: 期間（分）
km: រយៈពេល (នាទី)

# csvHeaderPreset
source: Preset
es: Preajuste
ja: プリセット
km: ការកំណត់ជាមុន

# csvHeaderAverageDB
source: Average dB
es: dB promedio
ja: 平均dB
km: dB មធ្យម

# csvHeaderMinDB
source: Min dB
es: dB mínimo
ja: 最小dB
km: dB អប្បបរមា

# csvHeaderMaxDB
source: Max dB
es: dB máximo
ja: 最大dB
km: dB អតិបរមា

# csvHeaderEvents
source: Events
es: Eventos
ja: イベント
km: ព្រឹត្តិការណ៍

# csvHeaderQualityScore
source: Quality Score
es: Puntuación de calidad
ja: 品質スコア
km: ពិន្ទុគុណភាព

# csvHeaderQuality
source: Quality
es: Calidad
ja: 品質
km: គុណភាព

# csvHeaderRecommendation
source: Recommendation
es: Recomendación
ja: 推奨事項
km: អនុសាសន៍

source: Sleep Analysis
es: Análisis de sueño
ja: 睡眠分析
km: វិភាគការគេង

source: Work Environment
es: Entorno de trabajo
ja: 作業環境
km: បរិយាកាសការងារ

source: Focus Session
es: Sesión de concentración
ja: 集中セッション
km: សម័យផ្តោតអារម្មណ៍

source: Recording Complete
es: Grabación completada
ja: 録音完了
km: ការថតបានបញ្ចប់

source: Preset Name
es: Nombre del preajuste
ja: プリセット名
km: ឈ្មោះការកំណត់ជាមុន

source: Average Decibels
es: Decibelios promedio
ja: 平均デシベル
km: ដេស៊ីបែលមធ្យម

source: Peak Decibels
es: Decibelios máximos
ja: ピークデシベル
km: ដេស៊ីបែលកំពូល

source: Environment Quality
es: Calidad del entorno
ja: 環境品質
km: គុណភាពបរិយាកាស

source: View Report
es: Ver informe
ja: レポートを表示
km: មើលរបាយការណ៍

source: Altimeter
es: Altímetro
ja: 高度計
km: ឧបករណ៍វាស់កម្ពស់

# altimeterWaiting
source: Waiting for GPS and barometer data...
es: Esperando datos del altímetro...
ja: 高度計データを待っています...
km: កំពុងរង់ចាំទិន្នន័យកម្ពស់...

source: Above Sea Level
es: Sobre el nivel del mar
ja: 海抜
km: លើកម្រិតទឹកសមុទ្រ

source: Climbing
es: Subiendo
ja: 上昇中
km: កំពុងឡើង

source: Descending
es: Bajando
ja: 下降中
km: កំពុងចុះ

source: Stable
es: Estable
ja: 安定
km: ស្ថេរភាព

# usingGpsOnly
source: Using GPS data only
es: Usando solo GPS
ja: GPSのみ使用
km: ប្រើតែ GPS

# usingBarometerOnly
source: Using barometer data only
es: Usando solo barómetro
ja: 気圧計のみ使用
km: ប្រើតែបារ៉ូម៉ែត្រ

# usingFusedData
source: Combining GPS and barometer for accuracy
es: Usando datos combinados
ja: 統合データ使用
km: ប្រើទិន្នន័យរួមបញ្ចូលគ្នា

source: Data Source
es: Fuente de datos
ja: データソース
km: ប្រភពទិន្នន័យ

source: Sensor Readings
es: Lecturas del sensor
ja: センサー読み取り値
km: ការអានសេន្សួរ

source: GPS Altitude
es: Altitud GPS
ja: GPS高度
km: កម្ពស់ GPS

source: Baro Altitude
es: Altitud Barométrica
ja: 気圧高度
km: កម្ពស់បារ៉ូម៉ែត្រ

source: Pressure
es: Presión
ja: 気圧
km: សម្ពាធ

source: Statistics
es: Estadísticas
ja: 統計
km: ស្ថិតិ

source: Gain
es: Ganancia
ja: 上昇
km: ការកើនឡើង

source: Loss
es: Pérdida
ja: 下降
km: ការថយចុះ

source: Calibrate Altimeter
es: Calibrar Altímetro
ja: 高度計を校正
km: ក្រិត​កម្ពស់​ស្តង់ដារ

# calibrateDescription
source: Enter your current known altitude in meters to calibrate the barometric sensor for better accuracy.
es: Ingrese su altitud conocida actual para calibrar
ja: 校正のために現在の既知の高度を入力してください
km: បញ្ចូលកម្ពស់ដែលស្គាល់បច្ចុប្បន្នរបស់អ្នកដើម្បីក្រិតស្តង់ដារ
